///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОтметитьОпубликованым(Знач ОпубликованныеОписания) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Для Каждого ОпубликованноеОписание Из ОпубликованныеОписания Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача = ОпубликованноеОписание.Задача;
		МенеджерЗаписи.ДатаДобавления = ОпубликованноеОписание.ДатаДобавления;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ДатаПубликации = ТекущаяДата;
		
		Если ОпубликованноеОписание.Свойство("Опубликовано") Тогда 
			МенеджерЗаписи.Опубликовано = ОпубликованноеОписание.Опубликовано;
		Иначе 
			МенеджерЗаписи.Опубликовано = Истина;
		КонецЕсли;   
		
		Если НЕ МенеджерЗаписи.Опубликовано Тогда 
			МенеджерЗаписи.ОписаниеИзмененийСистемы = Справочники.ОписанияИзмененийСистемы.ПустаяСсылка();
		ИначеЕсли  ОпубликованноеОписание.Свойство("ОписаниеИзмененийСистемы") Тогда 
			МенеджерЗаписи.ОписаниеИзмененийСистемы = ОпубликованноеОписание.ОписаниеИзмененийСистемы;
		КонецЕсли; 
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
