///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПодключитьВнешнююОбработкуНаСервере();
	Уникальность = "Обработка.ПанельАдминистрирования.Форма.StandardFullTextSearchManagement" 
		+ ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", "");
	
	ОткрытьФорму("ВнешняяОбработка.StandardFullTextSearchManagement.Форма",
		Новый Структура, ПараметрыВыполненияКоманды.Источник, Уникальность,	ПараметрыВыполненияКоманды.Окно);	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодключитьВнешнююОбработкуНаСервере()
	
	ВнешниеОбработки.Подключить("v8res://mngbase/StandardFullTextSearchManagement.epf", "StandardFullTextSearchManagement", false); 
	
КонецПроцедуры

#КонецОбласти
