///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	

// Создает элемент справочника Подписчики и возвращаетс ссылку на него
//
// Параметры:
//  Почта - Строка - адрес электронной почты 
// 
// Возвращаемое значение:
// Структура 
//
Функция Добавить(Знач Почта) Экспорт
	
	Результат = Новый Структура("ТекстОшибки, Ссылка", "", Справочники.Подписчики.ПустаяСсылка());
	
	НоваяЗапись = СоздатьЭлемент();
	НоваяЗапись.Наименование = Почта; 
	
	Попытка
		НоваяЗапись.Записать();
		Результат.Ссылка = НоваяЗапись.Ссылка;
	Исключение
		Результат.ТекстОшибки = "Не удалось создать подписчика по причине: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
		
#КонецЕсли
