///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Убираем слеш в конце адресной строки
	Если СтрЗаканчиваетсяНа(Значение, "/") ИЛИ СтрЗаканчиваетсяНа(Значение, "\") Тогда
		Значение = Лев(Значение, СтрДлина(Значение) - 1);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
