///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.> Например:
//  
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьГруппыДоступаПользователя(Знач Пользователь = Неопределено, Знач ФилиалПользователя = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФилиалПользователя) Тогда
		ФилиалПользователя = ПараметрыСеанса.Филиал;
	КонецЕсли;
		
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаУчастники.Ссылка КАК ГруппыДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.Участники КАК ГруппыДоступаУчастники
	|ГДЕ
	|	(ВЫРАЗИТЬ(ГруппыДоступаУчастники.Элемент КАК Справочник.Пользователи)) = &Пользователь
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГруппыДоступаУчастники.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Участники КАК ГруппыДоступаУчастники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (Пользователи.Ссылка = &Пользователь)
	|			И ГруппыДоступаУчастники.Элемент = Пользователи.Должность
	|ГДЕ
	|	(ВЫРАЗИТЬ(ГруппыДоступаУчастники.Элемент КАК Справочник.Должности)) = Пользователи.Должность
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГруппыДоступаУчастники.Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа.Участники КАК ГруппыДоступаУчастники
	|ГДЕ
	|	(ВЫРАЗИТЬ(ГруппыДоступаУчастники.Элемент КАК Справочник.Филиалы)) = &ФилиалПользователя";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ФилиалПользователя", ФилиалПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГруппыДоступа");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедуры по получению групп доступа для должности и группы разработки.
// ...
// ...

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Раздел «Служебные процедуры и функции» содержит процедуры и функции, составляющие внутреннюю 
// реализацию общего модуля. Объемные разделы модулей рекомендуется разбивать на подразделы
// по функциональному признаку.

#КонецОбласти
	
#КонецЕсли
