///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переместить (вывод элементов в подменю Безопансость)
Процедура ДобавитьКнопкуНастройкаПравОбъекта(Форма, Знач ИмяГруппыВывода) Экспорт
	
	ЭлементГруппаВывода = Форма.Элементы.Найти(ИмяГруппыВывода);
		
	Если ЭлементГруппаВывода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить("Подключаемый_ОткрытьНастройкуПравОбъекта");
	Команда.Действие		= "Подключаемый_ОткрытьНастройкуПравОбъекта";
	Команда.Картинка        = БиблиотекаКартинок.БезопасностьОбъектовМетаданных;
	Команда.Отображение     = ОтображениеКнопки.Картинка;
	Команда.Подсказка       = "Открыть форму настройки прав объекта.";
	
	КнопкаПанели = Форма.Элементы.Добавить("Подключаемый_ОткрытьНастройкуПравОбъекта", Тип("КнопкаФормы"), ЭлементГруппаВывода);
	КнопкаПанели.ИмяКоманды = Команда.Имя;
	КнопкаПанели.Заголовок = "Настройка прав объектов";
	
КонецПроцедуры

Процедура ДобавитьКнопкуСписокПрав(Форма, Знач ИмяГруппыВывода) Экспорт
	
	ЭлементГруппаВывода = Форма.Элементы.Найти(ИмяГруппыВывода);
		
	Если ЭлементГруппаВывода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить("Подключаемый_ОткрытьСписокПравДляПользователя");
	Команда.Действие		= "Подключаемый_ОткрытьСписокПравДляПользователя";
	Команда.Картинка        = БиблиотекаКартинок.БезопасностьОбъектов;
	Команда.Отображение     = ОтображениеКнопки.Картинка;
	Команда.Подсказка       = "Открыть форму просмотра списка прав.";
	
	КнопкаПанели = Форма.Элементы.Добавить("Подключаемый_ОткрытьСписокПравДляПользователя", Тип("КнопкаФормы"), ЭлементГруппаВывода);
	КнопкаПанели.ИмяКоманды = Команда.Имя;
	КнопкаПанели.Заголовок = "Список прав";
	
КонецПроцедуры

#КонецОбласти
