///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрыСведений.ОтслеживаниеИспользованияФункциональности.ОткрытиеФормы(ЭтотОбъект.ИмяФормы);
	
	Если Параметры.Свойство("ВыбранныеОбъекты") И Параметры.ВыбранныеОбъекты.Количество() > 0 Тогда
		Для Каждого ВыбранныйОбъект Из Параметры.ВыбранныеОбъекты Цикл
			ЗаполнитьЗначенияСвойств(ВыбранныеОбъекты.Добавить(), ВыбранныйОбъект);
		КонецЦикла;
	КонецЕсли;
	
	СписокОбъектов.Параметры.УстановитьЗначениеПараметра("ОтборПоТипу", ОтборПоТипу);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	СписокОбъектов.Параметры.УстановитьЗначениеПараметра("ОтборПоТипу", ОтборПоТипу);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого ВыбранныйОбъект Из ВыбранныеОбъекты  Цикл
		Результат.Добавить(ВыбранныйОбъект.Ссылка);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	
	ВыбранныеОбъекты.Очистить();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВыбранныеОбъекты.Добавить(), ТекущиеДанные, "Ссылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипуПриИзменении(Элемент)
	
	ОбновитьДинамическийСписок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДинамическийСписок()
	
	СписокОбъектов.Параметры.УстановитьЗначениеПараметра("ОтборПоТипу", ОтборПоТипу);
	
КонецПроцедуры

#КонецОбласти
