///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает макет отчета АнализДеятельности.
//
// Параметры:
//  ИмяМакета - Строка - имя макета, как оно задано в Конфигураторе.
//
// Возвращаемое значение:
//  Любой объект, который может быть макетом.
//
Функция ПолучитьМакетОтчета(Знач ИмяМакета = "ОсновнойМакет") Экспорт
	
	Возврат Отчеты.АнализДеятельности.ПолучитьМакет(ИмяМакета);
	
КонецФункции

#КонецОбласти
