///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыРасшифровки = ОбщегоНазначенияВызовСервера.ПолучитьПараметрыРасшифровки(ДанныеРасшифровки, Расшифровка);
	
	ДокументСсылка = Неопределено;
	
	Если ПараметрыРасшифровки.Свойство("Задача") Тогда
		ДокументСсылка = ПараметрыРасшифровки.Задача;
	ИначеЕсли ПараметрыРасшифровки.Свойство("Заявка") Тогда
		ДокументСсылка = ПараметрыРасшифровки.Заявка;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ПоказатьЗначение(, ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти
