///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокПравДляОбъекта(Параметры.ПолноеИмяФормы, Параметры.СсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПравДляОбъекта(Знач ПолноеИмяФормы, Знач СсылкаНаОбъект)
	
	ТаблицаПравОбъекта = Безопасность.ПолучитьНастройкиБезопасностиПоОбъектуДляПользователя(ПолноеИмяФормы, СсылкаНаОбъект);
	
	Для Каждого СтрокаТаблицы Из ТаблицаПравОбъекта Цикл
		НоваяСтрока = ТаблицаПрав.Добавить();
		НоваяСтрока.Право = СтрокаТаблицы.Право;
		НоваяСтрока.ВидРазрешения = Строка(СтрокаТаблицы.ВидРазрешенияПредставление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
