///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПередЗаписью(Отказ)
	
	// собираем шаблон из табличной части справочника
	Описание = "";
	Шаблон = "%1<%2>%3</%2>
			|<p>&nbsp;</p>
			|";
	
	Для Каждого Строка Из СтруктураОписания Цикл		
		Описание = СтрШаблон(Шаблон, Описание, Строка.СтильНаписания, Строка.Раздел);		
	КонецЦикла;
	
	ШаблонHTML = Описание;
	
КонецПроцедуры
