///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Знач Объект, Знач ЮридическоеЛицо, Знач Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.ЮридическоеЛицо = ЮридическоеЛицо;
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
