///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Знач Объект, Знач Сложность) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Прочитать();
	
	Если ЗначениеЗаполнено(Сложность) Тогда
		Если Сложность <> МенеджерЗаписи.Сложность Тогда
			МенеджерЗаписи.Объект = Объект;
			МенеджерЗаписи.Сложность = Сложность;
			МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
			МенеджерЗаписи.ДатаДобавления = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	ИначеЕсли МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСложность(Знач Объект) Экспорт
	
	Данные = Получить(Новый Структура("Объект", Объект));
	Возврат Данные.Сложность;
	
КонецФункции

#КонецОбласти
