///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

// Возвращает строку-представление для сохранения ссылки на элемент справочника в дополнительных свойствах объекта. 
//
// Параметры:
//  ИмяРеквизита - Строка - определяет тип описания, сохраненного в элементе справочника.
// 
// Возвращаемое значение:
//  Строка - имя дополнительного свойства 
//
Функция ИмяДополнительногоСвойстваСсылка(Знач ИмяРеквизита) Экспорт 

	Возврат СтрШаблон("Ссылка%1", ИмяРеквизита);
	
КонецФункции

// Возвращает строку-представление для сохранения содержания описания в дополнительных свойствах объекта.
//
// Параметры:
//  ИмяРеквизита - Строка - определяет тип описания, сохраненного в элементе справочника. 
// 
// Возвращаемое значение:
//  Строка - имя дополнительного свойства
//
Функция ИмяДополнительногоСвойстваСодержаниеОписания(Знач ИмяРеквизита) Экспорт

	Возврат СтрШаблон("СодержаниеОписания%1", ИмяРеквизита);
	
КонецФункции

// Возвращает строку-представление для сохранения содержания признака того, что описание было изменено, 
// в дополнительных свойствах объекта.
//
// Параметры:
//  ИмяРеквизита - Строка - определяет тип описания, сохраненного в элементе справочника. 
// 
// Возвращаемое значение:
//  Строка - имя дополнительного свойства 
//
Функция ИмяДополнительногоСвойстваИзмененоОписание(Знач ИмяРеквизита) Экспорт
	
	Возврат СтрШаблон("ИзмененоОписание%1", ИмяРеквизита);
	
КонецФункции

Функция ПроверяемыеСвойстваОбъекта() Экспорт
	
	Результат = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Структура);
	
	// Названия реквизитов объекта
	Результат.Реквизиты.Добавить("Описание");
	
	Возврат Результат;
	
КонецФункции
