///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

// Хранит описание изменений до записи объекта
Перем ОписаниеДоЗаписи;

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеДоЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Описание");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Код закомментирован по причине ошибки в ЖР (требуются доработки):
	// Ошибка сохранения использования файлов в описании. Описание ошибки: {РегистрСведений.ПрикрепленныеФайлы.МодульМенеджера(168)}: 
	// Ошибка при вызове метода контекста (Записать): Запись не верна! Значение поля "Объект" не может быть пустым!
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияДополнительныхРеквизитовОбъектов.Объект КАК Объект,
	|	ЗначенияДополнительныхРеквизитовОбъектов.Реквизит КАК Реквизит,
	|	ЗначенияДополнительныхРеквизитовОбъектов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОбъектов КАК ЗначенияДополнительныхРеквизитовОбъектов
	|ГДЕ
	|	ЗначенияДополнительныхРеквизитовОбъектов.Значение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ОписаниеИзменилось = ИсторияИзменений.СравнитьОписанияОбъектаПриЗаписи(Выборка.Объект, ОписаниеДоЗаписи, Описание, Неопределено, Выборка.Реквизит);
	
КонецПроцедуры
