///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает имя программно генерируемого реквизита формы
// 
// Возвращаемое значение:
//   - Строка
//
Функция ИмяРеквизитаАдреса() Экспорт
	
	Возврат "ДополнительныеРеквизиты_АдресВременногоХранилища";
	
КонецФункции

// Возвращает структуру ключей настроек
// 
// Возвращаемое значение:
//   - Структура
//		* Объект	- Строка - ключ объекта
//		* Настройка	- Строка - ключ настройки
//
Функция ПолучитьКлючиНастроек() Экспорт
	
	Ключи = Новый Структура;
	Ключи.Вставить("Объект", "ДополнительныеРеквизиты");
	Ключи.Вставить("Настройка", "ДополнительныеРеквизитыОбъектаОснования");
	
	Возврат Ключи;
	
КонецФункции

// Возвращает имя служебного реквизита, который указывает на
// вывод доп реквизитов на фомру объекта
// 
// Возвращаемое значение:
// 	Строка - Имя служебного реквизита
//
Функция ПолучитьИмяСлужебногоРеквизита() Экспорт
			
	Возврат "ИмяГруппыВыводаДопРеквизитов";
	
КонецФункции

// Возвращает имя группы, которая используется для вывода доп реквизитов на форму
// 
// Возвращаемое значение:
//  Строка - Имя группы, которая используется для вывода доп реквизитов на форму 
//
Функция ПолучитьИмяГруппыВыводаДопРеквизитов() Экспорт
			
	Возврат "ГруппаДопРеквизитыНаФорме";
	
КонецФункции

#КонецОбласти
