///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Разбивает полное имя метаданного на составляющие
//
// Параметры:
//  СтрокаНазвания	 - Строка	 - полное имя метаданного
// 
// Возвращаемое значение:
//   - Структура
//		* Тип		 - Строка	 - название типа (Справочники, Обработки, Документы и т.п.)
//		* Название	 - Строка	 - имя объекта метаданных
//		* Форма		 - Строка	 - имя формы объекта метаданного (если она есть)
//
Функция ПолучитьМетаданныеФормы(Знач СтрокаНазвания) Экспорт
	
	Результат = Новый Структура("Тип, Название, Форма", "", "", "");
	
	ЧастиИмениФормы = СтрРазделить(СтрокаНазвания, ".", Ложь);
	
	// Название типа метаданных в единственном числе.
	// Требуется перевести его во множественное.
	ТипМетаданного = ЧастиИмениФормы[0];
	
	Если ТипМетаданного = "Документ" Тогда
		ТипМетаданного = "Документы";
	ИначеЕсли ТипМетаданного = "Справочник" Тогда
		ТипМетаданного = "Справочники";
	ИначеЕсли ТипМетаданного = "Обработка" Тогда
		ТипМетаданного = "Обработки";
	ИначеЕсли ТипМетаданного = "РегистрСведений" Тогда
		ТипМетаданного = "РегистрыСведений";
	ИначеЕсли ТипМетаданного = "ПланВидовХарактеристик" Тогда
		ТипМетаданного = "ПланыВидовХарактеристик";
	ИначеЕсли ТипМетаданного = "ОбщаяФорма" Тогда
		ТипМетаданного = "ОбщиеФормы";
	КонецЕсли;
	
	Результат.Тип = ТипМетаданного;
	Результат.Название = ЧастиИмениФормы[1];
	
	Если ЧастиИмениФормы.Количество() >= 3 Тогда
		Результат.Форма = ЧастиИмениФормы[ЧастиИмениФормы.ВГраница()];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
