///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьУчастников(Знач Документ, Знач Участники) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Документ);
	
	Если Участники.Количество() > 0 Тогда
		Участники.Колонки.Добавить("Объект");
		Участники.ЗаполнитьЗначения(Документ, "Объект");
		НаборЗаписей.Загрузить(Участники);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ИзменитьЗапись(Знач Документ, Знач Пользователь, Знач Активный) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Документ;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Активный = Активный;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
