///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает имя реквизита(надпись для блокировки описания) используемых для функционирования редактора.
//
// Параметры:
//  ИмяРеквизита - Строка - дополнительный параметр для использования нескольких редакторов на одной форме.
// 
// Возвращаемое значение:
//  Строка - имя реквизита.
//
Функция ИмяНадписиБлокировкаОписания(Знач ИмяРеквизита = "") Экспорт
	
	Возврат СтрШаблон("РедакторОписания_Блокировка%1", ИмяРеквизита);
	
КонецФункции

// Возвращает имя реквизита(связанный элемент формы имеет такое же имя) используемых для функционирования редактора.
//
// Параметры:
//  ИмяРеквизита - Строка - дополнительный параметр для использования нескольких редакторов на одной форме.
// 
// Возвращаемое значение:
//  Строка - имя реквизита.
//
Функция ИмяРеквизита(Знач ИмяРеквизита = "") Экспорт
	
	Возврат СтрШаблон("РедакторОписания_ТекстHTML%1", ИмяРеквизита);
	
КонецФункции

// Возвращает имя служебного реквизита для сохранения описания в момент переключения на другую страницу.
//
// Параметры:
//  ИмяРеквизита - Строка - дополнительный параметр для использования нескольких редакторов на одной форме.
// 
// Возвращаемое значение:
//  Строка - имя реквизита.
//
Функция ИмяРеквизитаАктуальноеОписание(Знач ИмяРеквизита = "") Экспорт
	
	Возврат СтрШаблон("РедакторОписания_АктуальноеОписание%1", ИмяРеквизита);
	
КонецФункции

// Возвращает имя реквизита хранящего признак того, что изменилось описание.
//
// Параметры:
//  ИмяРеквизита - Строка - дополнительный параметр для использования нескольких редакторов на одной форме.
// 
// Возвращаемое значение:
//  Строка - имя реквизита.
//
Функция ИмяРеквизитаИзмененоОписание(Знач ИмяРеквизита = "") Экспорт
	
	Возврат СтрШаблон("РедакторОписания_ИзмененоОписание%1", ИмяРеквизита);
	
КонецФункции

// Возвращает имя реквизита хранящего признак того, что открыли описание.
//
// Параметры:
//  ИмяРеквизита - Строка - дополнительный параметр для использования нескольких редакторов на одной форме.
// 
// Возвращаемое значение:
//  Строка - имя реквизита.
//
Функция ИмяРеквизитаОткрытиеОписания(Знач ИмяРеквизита = "") Экспорт
	
	Возврат СтрШаблон("РедакторОписания_Открытие%1", ИмяРеквизита);
	
КонецФункции

// Возвращает название функциональности для записи статистики.
// 
// Возвращаемое значение:
//  Строка - название функциональности.
//
Функция ИмяСобытияОткрытияРедактора() Экспорт
	
	Возврат "Открытие редактора";
	
КонецФункции

#КонецОбласти
