///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыбратьОтчеты") Тогда
		Если Параметры.ВыбратьОтчеты Тогда
			ВыбратьОтчеты = ВидСравненияКомпоновкиДанных.Равно;
		Иначе
			ВыбратьОтчеты = ВидСравненияКомпоновкиДанных.НеРавно;
		КонецЕсли;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
		ЭлементОтбора.ВидСравнения = ВыбратьОтчеты;	
		ЭлементОтбора.ПравоеЗначение = Справочники.ИнструментыСистемы.Отчеты;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры
