///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИсторияЭскалацииОшибок.Записывать = Истина;
	
	Для Каждого СтрокаТаблицы Из ОчередьЭскалации Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтатусРеагирования)
			И СтрокаТаблицы.СтатусРеагирования <> Перечисления.СтатусыОбработкиЭскалацииОшибок.НеТребуетРеакции Тогда
			
			Движение = Движения.ИсторияЭскалацииОшибок.Добавить();
			Движение.Период = Дата;
			Движение.Направление = Направление;
			Движение.Система = Система;
			Движение.СерьезностьОшибки = СерьезностьОшибки;
			Движение.ИдентификаторОчереди = СтрокаТаблицы.ИдентификаторОчереди;
			Движение.ДатаИзмененияСтатуса = СтрокаТаблицы.ДатаИзмененияСтатуса;
			Движение.ДатаУведомления = СтрокаТаблицы.ДатаУведомления;
			Движение.НомерОчереди = СтрокаТаблицы.НомерСтроки;
			Движение.СтатусРеагирования = СтрокаТаблицы.СтатусРеагирования;
			
			Если СтрокаТаблицы.СтатусРеагирования = Перечисления.СтатусыОбработкиЭскалацииОшибок.Ожидание Тогда
				РегистрыСведений.ОчередьСобытийНаОбработку.ОтправитьОповещениеОчередиЭскалации(Ссылка, СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
