///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СкрытьЛишниеКолонки Тогда 
		Элементы.СТО.Видимость = Ложь;
		Элементы.Список.ОтображатьКорень = Ложь;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Параметры.Филиал) Тогда 
		Элементы.Список.ТекущаяСтрока = Параметры.Филиал;
		Элементы.Список.Развернуть(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
