///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьКоличествоТиповФилиалов();
	ОбновитьКоличествоСпискаВыбора();
	ОбновитьДоступностьСпискаВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьКоличествоТиповФилиалов();
	ОбновитьКоличествоСпискаВыбора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ИспользоватьСписокВыбораПриИзменении(Элемент)
	
	ОбновитьДоступностьСпискаВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПриИзменении(Элемент)
	
	ОбновитьКоличествоСпискаВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоСпискаВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыФилиаловПриИзменении(Элемент)
	
	ОбновитьКоличествоТиповФилиалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыФилиаловПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоТиповФилиалов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДоступностьСпискаВыбора()
	
	Элементы.СписокВыбора.ТолькоПросмотр = НЕ Объект.ИспользоватьСписокВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоСпискаВыбора()
	
	КоличествоСпискаВыбора = Объект.СписокВыбора.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоТиповФилиалов()
	
	КоличествоТиповФилиалов = Объект.ТипыФилиалов.Количество();
	
КонецПроцедуры

#КонецОбласти
