///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() Тогда
		ПометкаУдаленияПередЗаписью = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
		ДополнительныеСвойства.Вставить("ПометкаУдаленияПередЗаписью", ПометкаУдаленияПередЗаписью);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ПометкаУдаленияПередЗаписью = Ложь;
	ДополнительныеСвойства.Свойство("ПометкаУдаленияПередЗаписью", ПометкаУдаленияПередЗаписью);
	
	Если ПометкаУдаления И НЕ ПометкаУдаленияПередЗаписью Тогда
		РегистрыСведений.ВидыЗадачФилиалов.УдалитьВидЗадачиПриПометкеУдаления(Ссылка);
		ДополнительныеСвойства.Вставить("ВидЗадачиПомеченНаУдаление");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
