///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Наименование КАК Пользователь,
	|	Пользователи.Почта КАК ЭлектроннаяПочта
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РолиПользователейПоНаправлениям.НаправлениеРазработки.Наименование КАК Направление
	|ИЗ
	|	РегистрСведений.РолиПользователейПоНаправлениям КАК РолиПользователейПоНаправлениям
	|ГДЕ
	|	РолиПользователейПоНаправлениям.Пользователь = &Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Направление";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		ЭлектроннаяПочта = Выборка.ЭлектроннаяПочта;
	КонецЕсли;
	
	ДоступныеНаправления.Загрузить(РезультатыЗапроса[1].Выгрузить());
	Если ДоступныеНаправления.Количество() = 0 Тогда
		Элементы.СтраницыДоступныеНаправления.ТекущаяСтраница = Элементы.СтраницаНетДоступныхНаправлений;
	Иначе
		Элементы.СтраницыДоступныеНаправления.ТекущаяСтраница = Элементы.СтраницаСписокДоступныхНаправлений;
	КонецЕсли;	
	
КонецПроцедуры
