///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДиапазоныФилиала(Знач Филиал, Знач ТаблицаДиапазонов) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Филиал.Установить(Филиал);
	
	ТаблицаДиапазонов.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	ТаблицаДиапазонов.ЗаполнитьЗначения(Филиал, "Филиал");
	
	НаборЗаписей.Загрузить(ТаблицаДиапазонов);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
