///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр ТегиОбъектов
//
// Параметры:
//  Тег	- СправочникСсылка.Тег - Ссылка на тег 
//  Объект	- ДокументСсылка.Задача, ДокументСсылка.Заявка -
//  - ссылка на объект, к которому требуется привязать тег 
//
Процедура Добавить(Знач Тег, Знач Объект) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Тег = Тег;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ДатаСоздания = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра ТегиОбъектов
//
// Параметры:
//  Тег	- СправочникСсылка.Тег - Ссылка на тег 
//  Объект - ДокументСсылка, СправочникСсылка - ссылка на объект, к которому требуется привязать тег 
//
Процедура Удалить(Знач Тег, Знач Объект) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Тег = Тег;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры			

#КонецОбласти

#КонецЕсли
