///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если форма открыта из карточки характеристики
	Если Параметры.Свойство("Отбор") Тогда
		СтруктураОтбора = Параметры.Отбор;
		
		// Если в отборе указан владелец
		Если СтруктураОтбора.Свойство("Владелец") Тогда
			
			// Установка отбора на список значений реквизитов
			ВладелецЗначений = СтруктураОтбора.Владелец;
			СписокДоступныеРеквизиты.Параметры.УстановитьЗначениеПараметра("Владелец", ВладелецЗначений);
			
			// Скрывает список видов характеристик
			Элементы.СписокВидовХарактеристик.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВидовХарактеристикПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокВидовХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецЗначений = ТекущиеДанные.Ссылка;
	
	СписокДоступныеРеквизиты.Параметры.УстановитьЗначениеПараметра("Владелец", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если НЕ ЗначениеЗаполнено(ВладелецЗначений) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура("Владелец", ВладелецЗначений);
	
	ОткрытьФорму("Справочник.ДоступныеЗначенияРеквизитов.Форма.ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект, КлючУникальности);
	
КонецПроцедуры

#КонецОбласти
