///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает список подключаемых команды панели навигации
// 
// Возвращаемое значение:
//   Список значенией - список подключаемых команды панели навигации
//
Функция КомандыПанелиНавигации() Экспорт

	Команды = Новый СписокЗначений;
	Команды.Добавить("Файлы", "Файлы", , БиблиотекаКартинок.Записать);
	
	Возврат Команды;
	
КонецФункции

Функция ПолучитьПрефикс() Экспорт
	
	Возврат "ВТ";
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("КороткийНомер");
	Поля.Добавить("Наименование");	
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("Внутренние трудозатраты %1. %2", Данные.КороткийНомер, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидДеятельностиДокумента(Знач Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутренниеТрудозатраты.ВидДеятельности КАК ВидДеятельности
	|ИЗ
	|	Документ.ВнутренниеТрудозатраты КАК ВнутренниеТрудозатраты
	|ГДЕ
	|	ВнутренниеТрудозатраты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ВидДеятельности;
	
КонецФункции

// Устанавливает ограничения использования полей в динамических списках 
// документа "Внутреннеие трудозатраты".
//
// Параметры:
//  Список - ДинамическийСписок - динамический список.
//  ПринадлежитIT - Булево - Пренадлежит ли пользователь IT структуре
Процедура УстановитьОграниченияСписка(Список, ПринадлежитIT = Ложь) Экспорт
	
	ИсключаемыеПоля = Новый Массив;
	Если НЕ ПринадлежитIT Тогда
		ИсключаемыеПоля.Добавить("Филиал");
	КонецЕсли;
	 
	ИсключаемыеПоля.Добавить("ПараметрыДанных");
	Список.УстановитьОграниченияИспользованияВОтборе(ИсключаемыеПоля);

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
