///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////
	
#Область ОписаниеПеременных

// Хранит результаты полнотекстового поиска
&НаКлиенте
Перем КонтейнерСостоянийПоиска Экспорт; 

&НаКлиенте
Перем ПредыдущаяАктивнаяСтраница Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПолнотекстовыйПоискКлиент.АвтоПодборПолнотекстовогоПоиска(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаПоиска = Элемент.ТекстРедактирования;
		ПоискПоНомеру = (ВыбранноеЗначение = 0);
		ПоискПоТегу = (ВыбранноеЗначение = 2);
		ПолнотекстовыйПоискКлиент.ПриВыполненииПоиска(, ЭтотОбъект, КонтейнерСостоянийПоиска, ПредыдущаяАктивнаяСтраница, ПоискПоНомеру, ПоискПоТегу);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если НЕ ПустаяСтрока(СтрокаПоиска) Тогда
		ПолнотекстовыйПоискКлиент.ПриВыполненииПоиска(, ЭтотОбъект, КонтейнерСостоянийПоиска, ПредыдущаяАктивнаяСтраница);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLСтраницаРезультатыПоискаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	УправлениеИнструментамиРазработкиКлиент.ПриНажатииПоляHTMLДокумента(ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Подключаемый_ОткрытьСправкуПолнотекстовыйПоиск(Команда)
	
	ОбщегоНазначенияКлиент.ОткрытьСправкуПолнотекстовыйПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСтраницаРезультатовПоиска(Команда)
	
	ПолнотекстовыйПоискКлиент.ПриВыполненииПоиска("ПредыдущаяЧасть", ЭтотОбъект,
		КонтейнерСостоянийПоиска, ПредыдущаяАктивнаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСтраницаРезультатовПоиска(Команда)
	
	ПолнотекстовыйПоискКлиент.ПриВыполненииПоиска("СледующаяЧасть", ЭтотОбъект,
		КонтейнерСостоянийПоиска, ПредыдущаяАктивнаяСтраница);
	
КонецПроцедуры

#КонецОбласти

ПредыдущаяАктивнаяСтраница = Новый Массив;
