///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьНаименования(Команда)
	
	ОбновитьНаименованияНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужубеныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбновитьНаименованияНаСервере()
	
	Выборка = Справочники.ВидыДеятельностиУслуг.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементОбъект = Выборка.ПолучитьОбъект();
		
		ОбъектЗаблокирован = Истина;
		Попытка
			ЭлементОбъект.Заблокировать();
		Исключение
			ОбъектЗаблокирован = Ложь;
			ТекстСообщения = "Не удалось заблокировать " + ЭлементОбъект.Код + " для изменения по причине: " + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Если ОбъектЗаблокирован Тогда
			ЭлементОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
