///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет тег и возвращает ссылку на него 
//
// Параметры:
//  ПредставлениеТега	 - Строка - Представление тега 
// 
// Возвращаемое значение:
// СправочникСсылка.Теги 
//
Функция Добавить(Знач ПредставлениеТега) Экспорт
	
	НовыйТег = Справочники.Теги.СоздатьЭлемент();
	НовыйТег.Наименование = ПредставлениеТега;
	НовыйТег.Автор = ПараметрыСеанса.ТекущийПользователь;
	НовыйТег.ДатаСоздания = ТекущаяДатаСеанса();
	НовыйТег.Записать();
		
	Возврат НовыйТег.Ссылка;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
