///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Объект = Отбор.Объект.Значение;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаявкаНаРазработку") Тогда
		Заявка = Объект;
	Иначе
		Заявка = РегистрыСведений.СвязьОбъектовСЗаявкамиНаРазработку.ПолучитьЗаявку(Объект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявка) Тогда 
		РегистрыСведений.ОчередьСобытийНаОбработку.ПересчитатьПлановыеТрудозатраты(Заявка);
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти
