///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ИспользуютсяСтандартныеНастройки Тогда
		ЭлементОтбора = Настройки.Элементы[1].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	
		ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
		ЭлементОтбора.Использование = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;	
	ПараметрыРасшифровки = ОбщегоНазначенияВызовСервера.ПолучитьПараметрыРасшифровки(ДанныеРасшифровки, Расшифровка, Ложь);
	
	Если ПараметрыРасшифровки.Свойство("Задача") Тогда
		ПоказатьЗначение(, ПараметрыРасшифровки.Задача);
	ИначеЕсли ПараметрыРасшифровки.Свойство("Спринт") И ЗначениеЗаполнено(ПараметрыРасшифровки.Спринт) Тогда
		ПоказатьЗначение(, ПараметрыРасшифровки.Спринт);
	ИначеЕсли ПараметрыРасшифровки.Свойство("Исполнитель") И ЗначениеЗаполнено(ПараметрыРасшифровки.Исполнитель) Тогда
		ИнтерфейсПриложенияКлиент.ОткрытьИнформациюОПользователе(ЭтотОбъект, 
			ПараметрыРасшифровки.Исполнитель, СтандартнаяОбработка);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
