///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

// Признак выполнения автоматического расчета минимального статуса заявки при
// записи набора в БД. Значение по умолчанию - Истина.
Перем АвтоматическийРасчетМинимальногоСтатуса Экспорт;

// Признак сохранения записей в истории статусов по системам
Перем СохранитьИсторию Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Заявка = ЭтотОбъект.Отбор.Заявка.Значение;
	
		Если АвтоматическийРасчетМинимальногоСтатуса = Истина Тогда
			РегистрыСведений.МинимальныеСтатусыЗаявок.РассчитатьМинимальныйСтатус(Заявка);
		КонецЕсли;
	
		Если СохранитьИсторию = Истина Тогда
			РегистрыСведений.ИсторияСтатусовЗаявокПоСистемам.Добавить(Заявка, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Инициализация

// По умолчанию минимальный статус заявки должен автоматически пересчитываться
АвтоматическийРасчетМинимальногоСтатуса = Истина;

// По умолчанию история статусов сохраняется
СохранитьИсторию = Истина;

#КонецОбласти

#КонецЕсли
