///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет в регистр сведений новую запись.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь.
//  ДанныеКлиента	 - Структура - данные клиента
//   *Браузер - название браузера
//   *ВерсияБраузера - версия браузера
//   *ОС - операционная система
//
Процедура Добавить(Знач Пользователь, Знач ДанныеКлиента)  Экспорт
	
	Период = ТекущаяДатаСеанса();
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.Период.Установить(Период);
	
	Запись = Набор.Добавить();
	Запись.Пользователь = Пользователь;   
	Запись.Период = Период;
	ЗаполнитьЗначенияСвойств(Запись, ДанныеКлиента);
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
