///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет запись
//
// Параметры:
//  Заявка		 - ДокументСсылка.ЗаявкаНаРазработку - Заявка
//  КлючОчереди	 - СправочникСсылка.КлючОчереди		 - Ключ очереди
//  Порядок		 - Число							 - Порядок очереди
//
Процедура ДобавитьЗапись(Знач Заявка, Знач КлючОчереди, Знач Порядок) Экспорт
		
	ДатаДобавления = ТекущаяДата();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НаборЗаписей.Отбор.КлючОчередиОбъекта.Установить(КлючОчереди);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Заявка = Заявка;
	НоваяЗапись.КлючОчередиОбъекта = КлючОчереди;	
	НоваяЗапись.Порядок = Порядок;
	НоваяЗапись.ДатаДобавления = ДатаДобавления;
	НоваяЗапись.Автор = Автор;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры 

#КонецОбласти
