///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр
//
// Параметры:
//  HTTPЗапрос - HTTPЗапрос - Запрос поступивший в сервис API
//
Процедура Добавить(Знач HTTPЗапрос) Экспорт
	
	ПараметрыЗапроса = HTTPЗапрос.ПараметрыЗапроса;
	МассивПараметров = Новый Массив;
	
	Для Каждого Элемент Из ПараметрыЗапроса Цикл
		МассивПараметров.Добавить(СтрШаблон("%1:%2", Элемент.Ключ, Элемент.Значение));
	КонецЦикла;
		
	ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторЗаписи);	
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Идентификатор = ИдентификаторЗаписи;
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	НоваяЗапись.URL = СтрШаблон("%1%2", HTTPЗапрос.БазовыйURL, HTTPЗапрос.ОтносительныйURL);	
	НоваяЗапись.Параметры = СтрСоединить(МассивПараметров, Символы.ПС);
	НоваяЗапись.ТелоЗапроса = HTTPЗапрос.ПолучитьТелоКакСтроку();
	НоваяЗапись.Дата = ТекущаяДатаСеанса();
		
	НаборЗаписей.Записать();	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
