///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет список выбора для индекса картинки на форме услуги
//
// Параметры:
//  СписокВыбора - СписокЗначений	 - список выбора
//
Процедура ЗаполнитьСписокВыбораКартинок(СписокВыбора) Экспорт
	
	СписокВыбора.Очистить();
	
	СписокВыбора.Добавить(0, 0, , БиблиотекаКартинок.ПустаяКартинка);
	СписокВыбора.Добавить(1, 1, , БиблиотекаКартинок.УслугаАналитика);
	СписокВыбора.Добавить(2, 2, , БиблиотекаКартинок.УслугаРазработкаТестов);
	СписокВыбора.Добавить(3, 3, , БиблиотекаКартинок.УслугаАрхитектура);
	СписокВыбора.Добавить(4, 4, , БиблиотекаКартинок.УслугаДизайн);
	СписокВыбора.Добавить(5, 5, , БиблиотекаКартинок.УслугаРазработка);
	СписокВыбора.Добавить(6, 6, , БиблиотекаКартинок.УслугаРазработкаВедущим);
	СписокВыбора.Добавить(7, 7, , БиблиотекаКартинок.УслугаТестирование);
	СписокВыбора.Добавить(8, 8, , БиблиотекаКартинок.УслугаУправлениеПроектом);
	
КонецПроцедуры

// Возвращает соответствие картинок из библиотеки услугам
// 
// Возвращаемое значение:
//  Соответствие - соответствие индекс - картинка библиотеки
//
Функция Картинки() Экспорт

	Картинки = Новый Соответствие;
	Картинки.Вставить(0, БиблиотекаКартинок.ПустаяКартинка);
	Картинки.Вставить(1, БиблиотекаКартинок.УслугаАналитика);
	Картинки.Вставить(2, БиблиотекаКартинок.УслугаРазработкаТестов);
	Картинки.Вставить(3, БиблиотекаКартинок.УслугаАрхитектура);
	Картинки.Вставить(4, БиблиотекаКартинок.УслугаДизайн);
	Картинки.Вставить(5, БиблиотекаКартинок.УслугаРазработка);
	Картинки.Вставить(6, БиблиотекаКартинок.УслугаРазработкаВедущим);
	Картинки.Вставить(7, БиблиотекаКартинок.УслугаТестирование);
	Картинки.Вставить(8, БиблиотекаКартинок.УслугаУправлениеПроектом);	

	Возврат Картинки;
	
КонецФункции

#КонецОбласти
