///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Для Каждого Настройка Из Элементы.СтраницаПрочее.ПодчиненныеЭлементы Цикл
		Настройка.Видимость = Параметры.ПрочиеНастройки.Свойство(Настройка.Имя);
		
		Если Настройка.Видимость Тогда
			ЭтотОбъект[Настройка.Имя] = Параметры.ПрочиеНастройки[Настройка.Имя];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Результат = Новый Структура;
	
	Для Каждого Настройка Из Элементы.СтраницаПрочее.ПодчиненныеЭлементы Цикл		
		Если Настройка.Видимость  Тогда
			Результат.Вставить(Настройка.Имя, ЭтотОбъект[Настройка.Имя]);
		КонецЕсли;
	КонецЦикла;	    
		
	Закрыть(Результат);	
	
КонецПроцедуры

#КонецОбласти
