///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////
   
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Год = Год(ТекущаяДатаСеанса());
	УстановитьОтборДат();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)

	УстановитьОтборДат();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда) 
	
	Если Год < 2001 Тогда 
		Сообщить("Год должен быть больше 2001");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоУмолчаниюНаСервере(); 
	Элементы.Список.Обновить();
	
КонецПроцедуры     

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере() 
	
	РегистрыСведений.ПроизводственныйКалендарь.ЗаполнитьКалендарь(Год);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДат() 
	
	Список.Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Год",
		Год, ВидСравненияКомпоновкиДанных.Равно);
		
КонецПроцедуры

#КонецОбласти
