///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает юрилические лица используемые направлением
//
// Параметры:
//  Направление  - СправочникСсылка.НаправленияРазработки - ссылка на юр лицо
//
// Возвращаемое значение:
//   Массив   - массив юридических лиц используемых направлением
//
Функция ЮридическиеЛица(Знач Направление = Неопределено) Экспорт
		
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаправленияРазработкиЮридическиеЛица.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ИЗ
	|	Справочник.НаправленияРазработки.ЮридическиеЛица КАК НаправленияРазработкиЮридическиеЛица
	|{ГДЕ
	|	НаправленияРазработкиЮридическиеЛица.Ссылка КАК Направление}";
	
	Если Направление <> Неопределено Тогда 
		ЭлементОтбора = Запрос.Отбор.Добавить("Направление");
		ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
		ЭлементОтбора.Значение = Направление;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Результат;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЮридическоеЛицо");

КонецФункции

#КонецОбласти

#КонецЕсли
