///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в историю
//
// Параметры:
//  СтруктураДанных		 - Структура													 - содержит данные для записи
//		* Период		 - Дата															 - период записи
//		* Объект		 - ДокументСсылка.ВнутреннееЗадание, СправочникСсылка.Проекты	 - ссылка на объект
//		* КлючСобытия	 - УникальныйИдентификатор										 - ключ события
//		* Статус		 - СправочникСсылка.СтатусыОбъектов								 - новый статус
//
Процедура Добавить(Знач СтруктураДанных) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураДанных);
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
