///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ШаблонСтраницы = 
	"<!DOCTYPE html>
	|<html lang='ru'>
	|	<head>
	|	</head>
	|	<body>
	|		<img src='%1'>
	|	</body>
	|</html>";
	
	ПолеHTML = СтрШаблон(ШаблонСтраницы, Параметры.НавигационнаяСсылка);
	
	ИмяФайла = Сред(Параметры.НавигационнаяСсылка, СтрНайти(Параметры.НавигационнаяСсылка, "/", НаправлениеПоиска.СКонца) + 1);
	Заголовок = ИмяФайла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КопироватьСсылку(Команда)
	
	ПолеHTMLИзображение = ПолеHTML;
	
	ТекстСообщения = "Ссылка скопирована в буфер обмена.";
	
	ОбщегоНазначенияКлиент.КопироватьТекстВБуферОбмена(Параметры.НавигационнаяСсылка, ТекстСообщения); 	
	
	// После копирования ссылки необходимо уведомить пользователя
	Состояние(ТекстСообщения);
	
	ПодключитьОбработчикОжидания("ВернутьИзображение", 0.1, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВернутьИзображение() Экспорт
	
	ПолеHTML = ПолеHTMLИзображение;

КонецПроцедуры

#КонецОбласти
