///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

Процедура Добавить(Знач Объект, Знач ВидТекста, Знач Текст) Экспорт
	
	ОчиститьФорматирование(Текст);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.ВидТекста = ВидТекста;
	МенеджерЗаписи.ИндексируемыйТекст = Текст;
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьФорматирование(Текст)
	
	Текст = СтрЗаменить(Текст, "**", "");
	Текст = СтрЗаменить(Текст, "*", "");

КонецПроцедуры

#КонецОбласти

#КонецЕсли
