///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Получает список доступных систем для QA
// 
// Возвращаемое значение:
//  СписокЗначений  - доступные системы учета
//
Функция ПолучитьСписокДоступныхСистемQA() Экспорт
	
	ПолныйСписокСистем = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СистемыУчета.Ссылка КАК Система,
	|	СистемыУчета.Наименование КАК СистемаПредставление
	|ИЗ
	|	Справочник.СистемыУчета КАК СистемыУчета
	|ГДЕ
	|	НЕ СистемыУчета.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СистемаПредставление";
		
	ВыборкаПолныйСписок = Запрос.Выполнить();
	
	Если НЕ ВыборкаПолныйСписок.Пустой() Тогда
		Выборка = ВыборкаПолныйСписок.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПолныйСписокСистем.Добавить(Выборка.Система, Выборка.СистемаПредставление, Истина);
		КонецЦикла;
	КонецЕсли;
		
	Возврат ПолныйСписокСистем;
	
КонецФункции

Функция ПолучитьСписокСтатусов() Экспорт

	ИсключаемыеСтатусы = Новый Массив;
	ИсключаемыеСтатусы.Добавить(Справочники.СтатусыОбъектов.РевьюТребований);
	ИсключаемыеСтатусы.Добавить(Справочники.СтатусыОбъектов.Отклонен);
	ИсключаемыеСтатусы.Добавить(Справочники.СтатусыОбъектов.Рассмотрен);
	ИсключаемыеСтатусы.Добавить(Справочники.СтатусыОбъектов.Решен);

	СписокСтатусов = Новый СписокЗначений;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка КАК Ссылка,
	|	СтатусыОбъектов.Представление КАК Представление
	|ИЗ
	|	Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	НЕ СтатусыОбъектов.Ссылка В (&ИсключаемыеСтатусы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыОбъектов.Порядок";

	Запрос.УстановитьПараметр("ИсключаемыеСтатусы", ИсключаемыеСтатусы);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСтатусов.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;

	Возврат СписокСтатусов;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
