///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.ДействияПриСменеСтатуса.ПроверитьПредопределенныеЭлементы";
	  
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействияПриСменеСтатуса.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДействияПриСменеСтатуса КАК ДействияПриСменеСтатуса
	|ГДЕ
	|	ДействияПриСменеСтатуса.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДействиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НоваяСтрока = ДействиеОбъект.ТипыОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Справочники.ТипыОбъектовВладельцев.Документ_Задача;
		
		Если Выборка.Ссылка = Справочники.ДействияПриСменеСтатуса.ДобавлениеВОчередьТестирования Тогда
			ДействиеОбъект.ВидДействия = Перечисления.ВидыДействий.ДобавлениеВОчередь;
			ДействиеОбъект.ОбратноеДействие = Справочники.ДействияПриСменеСтатуса.УдалениеИзОчередиТестирования;
			
		ИначеЕсли Выборка.Ссылка = Справочники.ДействияПриСменеСтатуса.УдалениеИзОчередиТестирования Тогда
			ДействиеОбъект.ВидДействия = Перечисления.ВидыДействий.ДобавлениеВОчередь;
			ДействиеОбъект.Служебный = Истина;
			
		Иначе
			ДействиеОбъект.ВидДействия = Перечисления.ВидыДействий.СменаИсполнителя;			
		КонецЕсли;
		
		ДействиеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
