///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает адрес публикации информационной базы на веб-сервере.
//
// Возвращаемое значение:
//  Строка - адрес публикации информационной базы.
//
Функция АдресПубликацииИнформационнойБазы() Экспорт
	
	Возврат ПараметрыСеанса.АдресаWebОкружения.АдресПубликацииИнформационнойБазы;
	
КонецФункции

// Возвращает URL-адрес служебных данных на веб-сервере.
//
// Возвращаемое значение:
//  Строка - адрес служебных данных.
//
Функция АдресПубликацииСлужебныхДанных() Экспорт
	
	Возврат ПараметрыСеанса.АдресаWebОкружения.АдресПубликацииСлужебныхДанных;
	
КонецФункции

// Возвращает URL-адрес каталога файлов на веб-сервере.
//
// Возвращаемое значение:
//  Строка - адрес публикации файлов.
//
Функция АдресПубликацииФайлов() Экспорт
	
	Возврат ПараметрыСеанса.АдресаWebОкружения.АдресПубликацииФайлов;
	
КонецФункции 

// Возвращает URL-адрес каталога хранения аватаров на веб-сервере.
//
// Возвращаемое значение:
//  Строка - адрес хранения аватаров.
//
Функция АдресХраненияАватаров() Экспорт
	
	Возврат ПараметрыСеанса.АдресаWebОкружения.АдресХраненияАватаров;
	
КонецФункции    

#КонецОбласти
