///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Добавляет новую запись в регистр сведений СвойстваЗадач.
//
// Параметры:
//  Объект      - ДокументСсылка.Задача - ссылка на документ "Задача".
//  Исполнитель - СправочникСсылка.Пользователи - ссылка на пользователя.
//  Статус      - СправочникСсылка.СтатусыОбъектов - статус объекта.
//  Порядок     - Число - порядок задачи в очереди.
//  Заблокировать -  Булево - признак необходимости установки на запись исключительной 
//                   блокировки.
//
Процедура Добавить(Знач Объект, Знач Исполнитель, Знач Статус, Знач Порядок, Знач Заблокировать = Истина) Экспорт
	
	Период = ТекущаяДатаСеанса();
	
	Если Заблокировать Тогда
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СвойстваВнутреннихЗаданий");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("Период", Период);
		ЭлементБлокировки.УстановитьЗначение("Объект", Объект);
		
		БлокировкаДанных.Заблокировать();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СвойстваВнутреннихЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период      = Период;
	НоваяЗапись.Объект      = Объект;
	НоваяЗапись.Исполнитель = Исполнитель;
	НоваяЗапись.Статус      = Статус;
	НоваяЗапись.Порядок     = Порядок;
	НоваяЗапись.Автор       = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
