///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Наименование = "" Тогда
		Массив = Новый Массив;
		
		Для Каждого Реквизит Из Метаданные.Справочники.КлючОчереди.Реквизиты Цикл 
			Значение = ЭтотОбъект[Реквизит.Имя];
			Если ЗначениеЗаполнено(Значение) Тогда
				Массив.Добавить(Строка(Значение));
			КонецЕсли;
		КонецЦикла;  
		
		Наименование = СтрСоединить(Массив, ";");
	КонецЕсли;	         
	
КонецПроцедуры

#КонецОбласти
