///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсключаемыеПоля = Новый Массив;
	ИсключаемыеПоля.Добавить("ПредставлениеДействия");
	
	Список.УстановитьОграниченияИспользованияВОтборе(ИсключаемыеПоля);
	Список.УстановитьОграниченияИспользованияВПорядке(ИсключаемыеПоля);
	Список.УстановитьОграниченияИспользованияВГруппировке(ИсключаемыеПоля);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НадписьПоказатьПодсказкуНажатие(Элемент)
	
	ИзменитьСостояниеПодсказки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПодсказкуНажатие(Элемент)
	
	ИзменитьСостояниеПодсказки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьСостояниеПодсказки(Знач Отображать) Экспорт
	
	Элементы.НадписьПоказатьПодсказку.Видимость = НЕ Отображать;
	Элементы.НадписьПодсказка.Видимость = Отображать;
	Элементы.СкрытьПодсказку.Видимость = Отображать;
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры

#КонецОбласти
