///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			// Добавление комментатора в участники 
			ТипОбъекта = ТипЗнч(Запись.Объект);
			ТипыОбъектовНаблюдения = Метаданные.ОпределяемыеТипы.ОбъектНаблюдения.Тип;
			СлужебныйПользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Пользователь, "Служебный");
			
			Если ТипыОбъектовНаблюдения.СодержитТип(ТипОбъекта) И НЕ СлужебныйПользователь Тогда
				Роль = Справочники.РолиУчастников.Наблюдатель;
				ЭтоУчастник = РегистрыСведений.Участники.ЭтоУчастник(Запись.Объект, Запись.Пользователь, Роль);
				
				Если НЕ ЭтоУчастник Тогда
					РегистрыСведений.Участники.Добавить(Запись.Объект, Запись.Пользователь, Роль);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
