///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если в форму передается владелец, то нужно проверить тип значения.
	// Если тип значения не является СправочникСсылка.ДоступныеЗначенияРеквизитов, то отказаться от создания.
	Если Параметры.Свойство("Владелец") Тогда
		Владелец = Параметры.Владелец;
		
		Если НЕ ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.РазрешеноСоздаватьДоступныеЗначения(Владелец) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать элементы, если тип значения владельца не ""Доступные значения реквизитов"".");
			Возврат;
		Иначе
			Объект.Владелец = Владелец;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Владелец.Доступность = УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли("Администратор");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ РазрешеноСоздаватьДоступныеЗначения(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать элементы, если тип значения владельца не ""Доступные значения реквизитов"".");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция РазрешеноСоздаватьДоступныеЗначения(Знач Значение)
	
	Возврат ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.РазрешеноСоздаватьДоступныеЗначения(Значение);
	
КонецФункции

#КонецОбласти
