///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

 #Область ПрограммныйИнтерфейс

// Получить настройку прочих отборов
// 
// Возвращаемое значение:
//  Структура  - насройка для отображения прочих отборов в НастройкиИнструментов 
//
Функция ПолучитьНастройкуПрочихОтборов() Экспорт
	 
	НазначенаПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	СистемаУчетаПустаяСсылка = Справочники.СистемыУчета.ПустаяСсылка();
	АвторПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	ЗаказчикПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	ФилиалЗаказчикаПустаяСсылка = Справочники.Филиалы.ПустаяСсылка();
	
	НастройкиПрочиеОтборы = Новый Структура;
	НастройкиПрочиеОтборы.Вставить("Назначена", 
		Новый Структура("ПоУмолчанию, ВидСравнения", НазначенаПустаяСсылка, ВидСравненияКомпоновкиДанных.Равно));
	НастройкиПрочиеОтборы.Вставить("СистемаУчета", 
		Новый Структура("ПоУмолчанию, ВидСравнения, Представление", СистемаУчетаПустаяСсылка, ВидСравненияКомпоновкиДанных.Равно, "Система учета"));
	НастройкиПрочиеОтборы.Вставить("Автор", 
		Новый Структура("ПоУмолчанию, ВидСравнения", АвторПустаяСсылка, ВидСравненияКомпоновкиДанных.Равно));
	НастройкиПрочиеОтборы.Вставить("Заказчик", 
		Новый Структура("ПоУмолчанию, ВидСравнения", ЗаказчикПустаяСсылка, ВидСравненияКомпоновкиДанных.Равно));	
    НастройкиПрочиеОтборы.Вставить("ФилиалЗаказчика", 
		Новый Структура("ПоУмолчанию, ВидСравнения, Представление", ФилиалЗаказчикаПустаяСсылка, ВидСравненияКомпоновкиДанных.Равно, "Филиал заказчика"));	

	Возврат НастройкиПрочиеОтборы;
	
КонецФункции

#КонецОбласти
