///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает структуру проверяемых данных
// 
// Возвращаемое значение:
//   - Структура
//		* Реквизиты	 - Массив	 - названия реквизитов которые требуют проверки
//		* ТабличныеЧасти	 - Структура	 - табличные части и их реквизиты которые требуют проверки.
//			Ключ - название табличной части
//			Значение - реквизит табличной части который требуется проверить
//
Функция ПроверяемыеСвойстваОбъекта() Экспорт
	
	Результат = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Структура);
	
	// Названия реквизитов объекта
	Результат.Реквизиты.Добавить("Наименование");
	Результат.Реквизиты.Добавить("Описание");
	Результат.Реквизиты.Добавить("ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьПодчиненныеКарточкиКолонки(Этап) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КарточкаКанбан.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ОчередьКанбан КАК ОчередьКанбан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючОчереди КАК КлючОчереди
	|		ПО ОчередьКанбан.КлючОчередиОбъекта = КлючОчереди.Ссылка
	|			И (КлючОчереди.ЭтапКанбана = &Этап)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КарточкаКанбан КАК КарточкаКанбан
	|		ПО ОчередьКанбан.Объект = КарточкаКанбан.Ссылка
	|			И (НЕ КарточкаКанбан.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КарточкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КарточкаОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
