///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ОписаниеРезультата; // Результат, возвращаемый в вызывающую форму

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменаОперации(Команда)
	
	ТекстВопроса = "Задача не будет переведена в статус ""Приостановлена"".
		|Продолжить?";
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьРезультатВопроса", ЭтотОбъект), 
		ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, 
		"Приостановка задачи"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеОперации(Команда)
	
	Если ПустаяСтрока(Комментарий) Тогда
		ПоказатьПредупреждение(, "Не заполнено описание причины приостановки задачи.", , 
			"Приостановка задачи");
		Возврат;
	КонецЕсли;
	
	ОписаниеРезультата.КодВозврата = КодВозвратаДиалога.ОК;
	ОписаниеРезультата.Комментарий = Комментарий;
	Закрыть(ОписаниеРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьРезультатВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОписаниеРезультата.КодВозврата = КодВозвратаДиалога.Отмена;
		Закрыть(ОписаниеРезультата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

// Результат, возвращаемый в вызывающую форму
ОписаниеРезультата = Новый Структура("КодВозврата, Комментарий");

#КонецОбласти
