///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли("Администратор") Тогда		
		СписокФилиалов = Справочники.Филиалы.ПолучитьВсеФилиалыРуководителя(); 
		СписокФилиалов.Добавить(Справочники.Филиалы.ПустаяСсылка());
		
		ОбщегоНазначения.ДобавитьЭлементОтбораКомпоновкиДанных(Список.КомпоновщикНастроек.Настройки,
			"Филиал", ВидСравненияКомпоновкиДанных.ВСписке, СписокФилиалов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
