///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() > 0 Тогда  
		
		Событие = ЭтотОбъект.Отбор.Событие.Значение; 
		
		Если Событие = Перечисления.СобытияПоЛичнымДелам.ПереведенВДругоеПодразделение 
			ИЛИ Событие = Перечисления.СобытияПоЛичнымДелам.ПринятНаДолжность Тогда 
			Сотрудник = ЭтотОбъект.Отбор.Сотрудник.Значение;
			Период = ЭтотОбъект.Отбор.Период.Значение;        
			РегистрыСведений.ОчередьСобытийНаОбработку.ДобавитьПроверкуДоступныхУслугФилиала(Сотрудник, Период);
		КонецЕсли;                             
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти
