///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура Добавить(Знач ГруппаДоступа, Знач Объект, Знач Роль, Знач ВидПраваДоступа) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ГруппаДоступа = ГруппаДоступа;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Роль = Роль;
	МенеджерЗаписи.ВидПраваДоступа = ВидПраваДоступа;
	
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура Удалить(Знач ГруппаДоступа, Знач Объект, Знач Роль) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГруппаДоступа.Установить(ГруппаДоступа);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Роль.Установить(Роль);
	
	НаборЗаписей.Записать();
		
КонецПроцедуры


#КонецОбласти

#КонецЕсли
