///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	
	Если Параметры.Отбор.Свойство("Филиал") Тогда
		МойФилиал = Истина;
		
		// Нужно добавить общий процесс с пустым филиалом
		СписокОтбор = Новый СписокЗначений;
		СписокОтбор.Добавить(Параметры.Отбор.Филиал);
		СписокОтбор.Добавить(Справочники.Филиалы.ПустаяСсылка());
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = СписокОтбор; 
		
		Параметры.Отбор.Удалить("Филиал");
		
		ИндексОтбора = Список.Отбор.Элементы.Индекс(ЭлементОтбора);
	Иначе 
		Элементы.МойФилиал.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МойФилиалПриИзменении(Элемент)
	
	ЭлементОтбора = Список.Отбор.Элементы.Получить(ИндексОтбора);
	ЭлементОтбора.Использование = МойФилиал;
	
КонецПроцедуры

#КонецОбласти
