///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Ссылка"); 
	ДанныеСпринта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметр.Значение, "ДатаНачала, ДатаОкончания");
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоСпринта"); 
	Параметр.Значение = ДанныеСпринта.ДатаНачала;
	Параметр.Использование = Истина;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецСпринта"); 
	Параметр.Значение = КонецДня(ДанныеСпринта.ДатаОкончания);
	Параметр.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти
