///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет данные объекта переданными в нее параметрами
//
// Параметры:
//  Форма					 - УправляемаяФорма - Форма объекта
//  ПараметрыЗаполнения	 - Структура - Восстановленые параметры
//
Процедура ЗаполнитьДанныеОбъектаИзАвтосохранения(Форма, ПараметрыЗаполнения) Экспорт
	
	Форма.СсылкаНаОбъектДляАвтосохранения = ПараметрыЗаполнения.Ссылка;
	
	Для Каждого РеквизитОбъекта Из ПараметрыЗаполнения.ЗначенияРеквизитов.РеквизитыОбъекта Цикл
		Форма.Объект[РеквизитОбъекта.Ключ] = РеквизитОбъекта.Значение;
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из ПараметрыЗаполнения.ЗначенияРеквизитов.ТабличныеЧасти Цикл
		Таблица = Форма.Объект[ТабличнаяЧасть.Ключ];
		
		Если ТабличнаяЧасть.Ключ = "СистемыРазработки" Тогда
			Для Каждого Строка Из ТабличнаяЧасть.Значение Цикл
				Отбор = Новый Структура("Система", Строка.Система);
				Строки = Таблица.НайтиСтроки(Отбор);
				
				Если Строки.Количество() > 0 Тогда
					Строки[0].ГруппаЗаказчиков = Строка.ГруппаЗаказчиков;
					Строки[0].ГруппаЗаказчиковПредставление = Строка(Строка.ГруппаЗаказчиков);
				Иначе 
					НоваяСтрока = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого Строка Из ТабличнаяЧасть.Значение Цикл
				НоваяСтрока = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого РеквизитФормы Из ПараметрыЗаполнения.ЗначенияРеквизитов.РеквизитыФормы Цикл
		Форма[РеквизитФормы.Ключ] = РеквизитФормы.Значение;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
