///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	
	Настройки = ОбщегоНазначенияВызовСервера.ПолучитьНастройкиСозданияКастомнойкоманды();
	ПараметрыОткрытия = Новый Структура();
	
	Если Настройки.ЕстьПраво Тогда 
		
		КастомныеКоманды = ПредопределенноеЗначение("Справочник.Филиалы.КастомныеКоманды");
		
		ОтборСписка = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ОтборСписка.ПравоеЗначение = КастомныеКоманды;
		ОтборСписка.Использование = Истина;	
		
		ПараметрыОткрытия.Вставить("Филиал", КастомныеКоманды);
		ПараметрыОткрытия.Вставить("СкрытьЛишниеКолонки", Истина);
		ПараметрыОткрытия.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Дерево);	
			
	Иначе    
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(Настройки.Команды);
		
		ОтборСписка = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборСписка.ПравоеЗначение = Список;
		ОтборСписка.Использование = Истина;	
		
		ПараметрыОткрытия.Вставить("СкрытьЛишниеКолонки", Истина);
		ПараметрыОткрытия.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);	
		
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", НЕ Настройки.ЕстьПраво);	
		
	ОткрытьФорму("Справочник.Филиалы.ФормаСписка", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
