///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Дата занята
//
// Параметры:
//  Дата	 - Дата	 - дата объекта
//  Филиал	 - СправочникСсылка.Филиалы	 - Филиал объекта
//  Ссылка	 - ДокументСсылка.ОтсутствияНаРабочемМесте	 - Объект
// 
// Возвращаемое значение:
//   Булево 
//
Функция ДатаЗанята(Знач Дата, Знач Филиал, Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтсутствияНаРабочемМесте.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтсутствияНаРабочемМесте КАК ОтсутствияНаРабочемМесте
	|ГДЕ
	|	ОтсутствияНаРабочемМесте.Филиал = &Филиал
	|	И ОтсутствияНаРабочемМесте.Проведен
	|	И ОтсутствияНаРабочемМесте.Дата = &Дата
	|	И НЕ ОтсутствияНаРабочемМесте.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции  

#КонецОбласти
