///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
			И Документы.ОтсутствияНаРабочемМесте.ДатаЗанята(Дата, Филиал, Ссылка) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ на выбранный период уже создан");   
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, Режим)
			
	// Заполнение движений по регистру сведений ОтсутствияСотрудниковНаРабочемМесте
	НаборДвижений = Движения.ОтсутствияСотрудниковНаРабочемМесте;
	НаборДвижений.Записывать = Истина;
	
	Для Каждого СтрокаТаблицы Из ДатыОтсутствияСотрудников Цикл
		НовоеДвижение = НаборДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТаблицы);
		
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Филиал = Филиал;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОбъектКопирования.ДатыОтсутствияСотрудников.Очистить();
	
КонецПроцедуры

#КонецОбласти 
