///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции управления доступом с повторным использованием
// возвращаемых значений:
// - для проверки ролей пользователя информационной базы.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет у пользователя информационной базы доступность указанной роли.
//
// Параметры:
// 	Роль - Строка - имя роли, как она задана в конфигурации.
//
// Возвращаемое значение:
//  Истина - роль доступна. Ложь - в противном случае.
//
Функция ПроверитьДоступностьРоли(Знач Роль) Экспорт
	
	Возврат Метаданные.Роли.Найти(Роль) <> Неопределено И РольДоступна(Роль);
	
КонецФункции

#КонецОбласти
