///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////
   
#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройкиПодключенияКMinio() Экспорт
		
	Если ИнтеграцияДополнительныхПодсистем.ПодсистемаСуществует("Minio") Тогда
		Модуль = ИнтеграцияДополнительныхПодсистем.ОбщийМодуль("ИнтеграцияMinio");
		Результат = Модуль.ПолучитьНастройкиПодключенияКMinio();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак требуется ли отправка комментария или вложения в jira
//
// Параметры:
//  Объект	 - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку	 - Объект
// 
// Возвращаемое значение:
//  Булево - признак требуется ли отправка комментария или вложения в jira
//
Функция ТребуетсяОтправкаКомментарияИлиВложенияВJira(Знач Объект) Экспорт
	
	Результат = Ложь;
	
	Если ИнтеграцияДополнительныхПодсистем.ПодсистемаСуществует("Jira") Тогда
		Модуль = ИнтеграцияДополнительныхПодсистем.ОбщийМодуль("ИнтеграцияJiraПовтИсп");
		Результат = Модуль.ТребуетсяОтправкаКомментарияИлиВложенияВJira(Объект);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Оценка производительности

// Функция определяет необходимость выполнения замеров
//
// Возвращаемое значение:
//  Булево - Истина выполнять, Ложь не выполнять.
//
Функция ВыполнятьЗамерыПроизводительности() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВыполнятьЗамерыПроизводительности.Получить();
	
КонецФункции  

////////////////////////////////////////////////////////////////////////////////
// БСП

// Возвращает имена подсистем
// 
// Возвращаемое значение:
//  Соответствие - имена подсистем
//
Функция ИменаПодсистем() Экспорт
	
	Имена = Новый Соответствие;
	ВставитьИменаПодчиненныхПодсистем(Имена, Метаданные);
	
	Возврат Новый ФиксированноеСоответствие(Имена);
	
КонецФункции  

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ВставитьИменаПодчиненныхПодсистем(Имена, РодительскаяПодсистема)
	
	Для Каждого ТекущаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл
		
		ИмяТекущейПодсистемы = ТекущаяПодсистема.Имя;
		Имена.Вставить(ИмяТекущейПодсистемы, Истина);
		
		Если ТекущаяПодсистема.Подсистемы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВставитьИменаПодчиненныхПодсистем(Имена, ТекущаяПодсистема);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
