///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранныеПолучатели = Параметры.ВыбранныеПолучатели;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьОВыборе(ВыбранныеПолучатели);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодписчика(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВводЭлектроннойПочты", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, , "Адрес электронной почты", 50);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователя(Команда)
	
	ПараметрыОткрытия = Новый Структура("ВыбранныеПользователи", ВыбранныеПолучатели);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборПользователей", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Пользователи.Форма.МножественныйВыбор", ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьПодпиcчика(Знач Подписчик)
	
	Если ВыбранныеПолучатели.НайтиПоЗначению(Подписчик.Подписчик) = Неопределено Тогда
		ВыбранныеПолучатели.Добавить(Подписчик.Подписчик, Подписчик.Представление);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЭлектроннойПочты(ПочтаПодписчика, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ПочтаПодписчика) Тогда	
		Результат = ПроверитьПодписчикаНаСервере(ПочтаПодписчика);
		
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ПоказатьПредупреждение(, Результат.ТекстОшибки);
		Иначе
			ДобавитьПодпиcчика(Результат);
		КонецЕсли;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПользователей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для Каждого Элемент Из ВыбранныеПолучатели Цикл
			Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Подписчики") Тогда
				Результат.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ВыбранныеПолучатели.ЗагрузитьЗначения(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПодписчикаНаСервере(Почта)
	
	Возврат ОбщегоНазначения.ПроверитьПодписчикаНаСервере(Почта);
	
КонецФункции

#КонецОбласти
