///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПредпросмотрИконки();
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЭтоГруппа Тогда
		Элементы.Родитель.Видимость = Ложь;
		Элементы.ВидОбъекта.Видимость = Ложь;
		Элементы.ГруппаПорядокБыстрыйДоступ.Видимость = Ложь;
		Элементы.ОбъектМетаданных.Видимость = Ложь;
	Иначе
		Элементы.ИмяДляБыстрогоДоступа.Доступность = Объект.БыстрыйДоступ;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВидовОбъекта(ЭтотОбъект, Ложь);
	ОбновитьПредпросмотрИконки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбъектМетаданныхПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораВидовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораВидовОбъекта(Форма, Знач ИзменениеОбъекта = Истина)
	
	Форма.Элементы.ВидОбъекта.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Форма.Объект.ОбъектМетаданных) Тогда
		ВидыОбъектов = ПолучитьВидыОбъектаМетаданных(Форма.Объект.ОбъектМетаданных);
		
		Для Каждого ВидОбъекта Из ВидыОбъектов Цикл
			Форма.Элементы.ВидОбъекта.СписокВыбора.Добавить(ВидОбъекта.Значение, ВидОбъекта.Представление);
		КонецЦикла;
		
		Если ИзменениеОбъекта И ВидыОбъектов.НайтиПоЗначению(Форма.Объект.ВидОбъекта) = Неопределено Тогда
			Форма.Объект.ВидОбъекта = ВидыОбъектов[0].Значение;
		КонецЕсли;
	Иначе
		Форма.Объект.ВидОбъекта = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредпросмотрИконки()
	
	Если ЗначениеЗаполнено(Объект.Иконка) Тогда
		МакетИконки = Справочники.ИнструментыСистемы.ПолучитьМакет("Иконка").ПолучитьТекст();
		ПредпросмотрИконки = СтрШаблон(МакетИконки, Объект.Иконка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыОбъектаМетаданных(Знач ОбъектМетаданных)
	
	Возврат Справочники.ИнструментыСистемы.ПолучитьВидыОбъектаМетаданных(ОбъектМетаданных);
	
КонецФункции

&НаКлиенте
Процедура БыстрыйДоступПриИзменении(Элемент)
	
	Элементы.ИмяДляБыстрогоДоступа.Доступность = Объект.БыстрыйДоступ;
	
КонецПроцедуры

#КонецОбласти
