///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеДействияОткрытьКомментарий() Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Действие", ДействиеОткрытьКомментарииОбъекта());
	Данные.Вставить("Текст", "Открыть комментарии...");
	Данные.Вставить("Картинка", БиблиотекаКартинок.Сообщение);
	
	Возврат Данные;
	
КонецФункции

Функция ЭтоДействиеОткрытьКомментарии(Знач Действие) Экспорт
	
	Возврат (Действие = ДействиеОткрытьКомментарииОбъекта());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДействиеОткрытьКомментарииОбъекта() Экспорт
	
	Возврат "ОткрытьКомментарииОбъекта";
	
КонецФункции

#КонецОбласти
