///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БлокировкаСеансов = ПолучитьБлокировкуСеансов();
	
	БлокировкаУстановлена = БлокировкаСеансов.Установлена;
	КодРазрешения         = БлокировкаСеансов.КодРазрешения;
	НачалоБлокировки      = БлокировкаСеансов.Начало;
	КонецБлокировки		  = БлокировкаСеансов.Конец;
	ТекстСообщения        = БлокировкаСеансов.Сообщение;
	
	Если НЕ БлокировкаУстановлена Тогда
		НачалоБлокировки = ТекущаяДатаСеанса();
		КонецБлокировки  = НачалоБлокировки + 1200;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьБлокировку(Команда)
	
	УстановитьБлокировкуСеансовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьБлокировкуСеансовНаСервере()
	
	БлокировкаСеансов = Новый БлокировкаСеансов;
	БлокировкаСеансов.КодРазрешения = КодРазрешения;
	БлокировкаСеансов.Сообщение     = ТекстСообщения;
	БлокировкаСеансов.Установлена   = БлокировкаУстановлена;
	
	Если БлокировкаУстановлена Тогда
		БлокировкаСеансов.Начало = НачалоБлокировки;
		БлокировкаСеансов.Конец  = КонецБлокировки;
	КонецЕсли;

	УстановитьБлокировкуСеансов(БлокировкаСеансов);
	
КонецПроцедуры

#КонецОбласти
