///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Сохраняет значения нескольких настроек. Если вторым параметром передан массив,
// то элементами массива должны быть структуры
//
// Параметры:
//  Филиал			 - СправочникСсылка.Филиалы	 - филиал-владелец настроек
//  ТаблицаНастроек	 - ТаблицаЗначений, Массив	 - данные настроек
//		* Настройка	 - ПланВидовХарактеристикСсылка.ВидыНастроекФилиалов	 - настройка
//		* Значение	 - Характеристика.ВидыНастроекФилиалов	 - значение настройки
//
Процедура СохранитьНастройки(Знач Филиал, Знач ТаблицаНастроек) Экспорт
	
	Для Каждого Строка Из ТаблицаНастроек Цикл
		СохранитьНастройку(Филиал, Строка.Настройка, Строка.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Сохраняет значение настройки для филиала
//
// Параметры:
//  Филиал		 - СправочникСсылка.Филиалы						 - филиал-владелец настройки
//  Настройка	 - ПланВидовХарактеристикСсылка.ВидыНастроекФилиала	 - настройка
//  Значение	 - Характеристика.ВидыНастроекФилиала				 - значение настройки
//
Процедура СохранитьНастройку(Знач Филиал, Знач Настройка, Знач Значение) Экспорт

	Дата = ТекущаяДатаСеанса();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Филиал.Установить(Филиал);
	НаборЗаписей.Отбор.Настройка.Установить(Настройка);
	НаборЗаписей.Отбор.Период.Установить(Дата);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Дата;
	НоваяЗапись.Филиал = Филиал;
	НоваяЗапись.Настройка = Настройка;
	НоваяЗапись.Значение = Значение;
	НоваяЗапись.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	Попытка
		НаборЗаписей.Записать();		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ИсторияИзмененийНастроекФилиалов.СохранитьНастройку", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
