///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Шаблон Из Параметры.ВыбранныеШаблоны Цикл
		СписокШаблонов.Добавить(Шаблон.Значение, Шаблон.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = Новый СписокЗначений;
	
	Для Каждого Шаблон Из СписокШаблонов Цикл
		Если ЗначениеЗаполнено(Шаблон.Значение) И Результат.НайтиПоЗначению(Шаблон.Значение) = Неопределено Тогда			
			Результат.Добавить(Шаблон.Значение, Шаблон.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры
