///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает имя кнопки настройки подменю панели навигации
// 
// Возвращаемое значение:
//  Строка - имя
//
Функция ИмяКнопкиНастройкиПодменю() Экспорт
	
	Возврат СтрШаблон(ШаблонИмениКнопки(), "НастроитьПодменю");
	
КонецФункции

// Возвращает имя кнопки подменю панели навигации
// 
// Возвращаемое значение:
//  Строка - имя
//
Функция ИмяКнопкиПодменю() Экспорт
	
	Возврат СтрШаблон(ШаблонИмениКнопки(), "Подменю");
	
КонецФункции

// Возвращает имя декорации панели навигации, используемой для выравнивания панели основной и вложенной формы
// 
// Возвращаемое значение:
//  Строка - имя
//
Функция ИмяДекорации() Экспорт
	
	Возврат СтрШаблон(ШаблонИмениКнопки(), "Декорация");
	
КонецФункции

// Возвращает имя командной панели навигации
// 
// Возвращаемое значение:
//  Строка - имя
//
Функция ИмяКоманднойПанели() Экспорт
	
	Возврат "ПанельНавигацииКоманднаяПанель";
	
КонецФункции

Функция ИмяДополнительнойКнопки(Знач ИмяОсновнойКнопки) Экспорт

	Возврат СтрЗаменить(ИмяОсновнойКнопки, "ПанельНавигации", "ПанельНавигацииДополнительно");	

КонецФункции

Функция ИмяОсновнойКнопки(Знач ИмяДополнительнойКнопки) Экспорт

	Возврат СтрЗаменить(ИмяДополнительнойКнопки, "ПанельНавигацииДополнительно", "ПанельНавигации");	

КонецФункции

// Возвращает максимальное количество кнопок, которые пользователь может выбрать для отображения в панели
// 
// Возвращаемое значение:
//  Число - количество
//
Функция МаксимальноеКоличествоВидимыхКоманд() Экспорт

	Возврат 6;	

КонецФункции

// Обновляет заголовок кнопки открытия страницы формы
//
// Параметры:
//  Форма - Управляемая форма - Форма документа
//  ИмяСтраницы - Строка - Имя страницы формы
//  Заголовок	 - Строка - Заголовок
//
Процедура ОбновитьЗаголовокКнопкиСтраницыПанелиНавигации(Форма, Знач ИмяСтраницы, Знач Заголовок) Экспорт
	
	ИмяКнопки = СтрШаблон(ШаблонИмениКнопкиСтраницы(), ИмяСтраницы);
	Форма.Элементы[ИмяКнопки].Заголовок = Заголовок;
	
	ИмяДополнительнойКнопки = ИмяДополнительнойКнопки(ИмяКнопки);
	Форма.Элементы[ИмяДополнительнойКнопки].Заголовок = Заголовок;	

КонецПроцедуры

// Возвращает шаблон для имени кнопки панели навигации
// 
// Возвращаемое значение:
//  Строка - шаблон
//
Функция ШаблонИмениКнопки() Экспорт
	
	Возврат "ПанельНавигации%1";
	
КонецФункции

// Возвращает шаблон для имени кнопки-страницы панели навигации
// 
// Возвращаемое значение:
//  Строка - шаблон
//
Функция ШаблонИмениКнопкиСтраницы() Экспорт
	
	Возврат "ПанельНавигацииСтраница%1";
	
КонецФункции

#КонецОбласти
