///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПограммныйИнтерфейс

// Добавляет новую связь комментариев
//
// Параметры:
//  ИдентификаторРодителя		 - УникальныйИдентификатор	 - родитель
//  ИдентификаторПодчиненного	 - УникальныйИдентификатор	 - подчиненный
//
Процедура Добавить(Знач ИдентификаторРодителя, Знач ИдентификаторПодчиненного) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Родитель.Установить(ИдентификаторРодителя);
	НаборЗаписей.Отбор.Подчиненный.Установить(ИдентификаторПодчиненного);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Родитель = ИдентификаторРодителя;
	НоваяЗапись.Подчиненный = ИдентификаторПодчиненного;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
