///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Задача") И Параметры.Свойство("НовыйСрокСдачи") И Параметры.Свойство("СтарыйСрокСдачи") Тогда	
		Задача = Параметры.Задача;
		ДатаКалендаря = Параметры.НовыйСрокСдачи;
		ПредыдущийСрокСдачи = Параметры.СтарыйСрокСдачи;
		
		// Заполнение заголовков
		СтарыйСрокСдачи = Формат(Параметры.СтарыйСрокСдачи, "ДФ='dd.MM.yyyy'");
		НовыйСрокСдачи = Формат(Параметры.НовыйСрокСдачи, "ДФ='dd.MM.yyyy'");
	Иначе
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Форма не предназначена для непосредственного открытия.";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаКалендаряПриИзменении(Элемент)
		
	НовыйСрокСдачи = Формат(ДатаКалендаря, "ДФ='dd.MM.yyyy'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		ПоказатьПредупреждение(, "Не заполнен комментарий.",,);
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ОбщегоНазначенияКлиент.ПроверитьКорректностьНовогоСрока(ДатаКалендаря, ПредыдущийСрокСдачи);

	Если РезультатПроверки.Ошибка Тогда
		ПоказатьПредупреждение(, РезультатПроверки.ТекстОшибки,,);
	Иначе
		ПараметрыЗакрытия = Новый Структура("СрокСдачи, Комментарий", ДатаКалендаря, Комментарий);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
