///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует структуру настроек для отображения прочих отборов в НастройкиИнструментов.
//
// Параметры:
//  Параметры - ДанныеФормыСтруктура - Параметры формы
// 
// Возвращаемое значение:
//   Структура  - настройки для прочих отборов. 
//
Функция ПолучитьНастройкуПрочихОтборов(Параметры) Экспорт
	
	ТипКанбана = Параметры.ТипКанбана;
	
	ПользовательПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	ТегПустаяСсылка = Справочники.Теги.ПустаяСсылка();
	ПроектПустаяСсылка = Справочники.Проекты.ПустаяСсылка();
	ПродуктПустаяСсылка = Справочники.Продукты.ПустаяСсылка();
	СистемаПустаяСсылка = Справочники.СистемыУчета.ПустаяСсылка();
	НаправлениеПустаяСсылка = Справочники.НаправленияРазработки.ПустаяСсылка();
	ФилиалПустаяСсылка = Справочники.Филиалы.ПустаяСсылка();
	НазначениеПустаяСсылка = Справочники.НазначенияЗадач.ПустаяСсылка();
	СпринтПустаяСсылка = Документы.Спринт.ПустаяСсылка();
	ГруппаЗаказчиковПустаяСсылка = Справочники.ГруппыЗаказчиковНаправлений.ПустаяСсылка();
	
	НастройкиПрочиеОтборы = Новый Структура;
	
	Если ТипКанбана = Перечисления.ТипыКанбана.ВнутреннееЗаданиеНовый Тогда 
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ДатаИзменения", Новый СтандартнаяДатаНачала, "Дата изменения");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Направление", НаправлениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);		
		
	ИначеЕсли ТипКанбана = Перечисления.ТипыКанбана.ЗаявкиМоегоФилиала Тогда
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ГруппаЗаказчиков", ГруппаЗаказчиковПустаяСсылка, "Группа заказчиков");	
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Направление", НаправлениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Продукт", ПродуктПустаяСсылка);  
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "СистемаУчета", СистемаПустаяСсылка, "Система учета");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);

	ИначеЕсли ТипКанбана = Перечисления.ТипыКанбана.ПулЗаявокНовый Тогда
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);
			
	Иначе
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ДатаИзменения", Новый СтандартнаяДатаНачала, "Дата изменения");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ГруппаЗаказчиков", ГруппаЗаказчиковПустаяСсылка, "Группа заказчиков");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Команда", ФилиалПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Направление", НаправлениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Продукт", ПродуктПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "СистемаУчета", СистемаПустаяСсылка, "Система учета");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);
		
	КонецЕсли;
	
	Возврат НастройкиПрочиеОтборы;
	
КонецФункции

#КонецОбласти

#Область Служебные

Процедура ВставитьНастройкуПоУмолчанию(Настройки, Ключ, ЗначениеПоУмолчанию, Представление = Неопределено) 
	
	Настройка = Новый Структура;
	Настройка.Вставить("ПоУмолчанию", ЗначениеПоУмолчанию); 
	
	Если Представление <> Неопределено Тогда
		Настройка.Вставить("Представление", Представление); 
	КонецЕсли;
	
	Настройки.Вставить(Ключ, Настройка);
	
КонецПроцедуры
	
#КонецОбласти
