///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		Объект = Параметры.Объект;
		МассивЗаинтересованных = ОбщегоНазначенияВызовСервера.ПолучитьЗаинтересованныхЛиц(Объект);
	
		Если МассивЗаинтересованных.Количество() > 0 Тогда
			Для Каждого Элемент Из МассивЗаинтересованных Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаЗаинтересованных.Добавить(), Элемент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ПанельНавигации.Скопировать(ЭтотОбъект, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПанельНавигацииКлиент.ПриОткрытии(Элементы, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ПанельНавигацииКлиент.ОбработкаОповещения(ЭтотОбъект, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	ОбщегоНазначенияКлиент.ОткрытьФормуЗаписиЗаинтересованныеЛица(ЭтотОбъект, ТаблицаЗаинтересованных, КлючУникальности, Объект);	
		
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаЗаинтересованных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.ОткрытьФормуЗаписиЗаинтересованныеЛица(ЭтотОбъект, ТаблицаЗаинтересованных, КлючУникальности, Объект, ТекущиеДанные.Пользователь);	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбщегоНазначенияКлиент.ОбновитьТаблицуЗаинтересованныхЛиц(Объект, ТаблицаЗаинтересованных);	
	Оповестить(СобытияОповещенияКлиент.ИмяСобытияОбновленияКоличестваЗаинтересованныхЛиц(), Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельНавигацииНажатие(Команда)
	
	ПанельНавигацииКлиент.Нажатие(ЭтотОбъект, Команда, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаЗаинтересованных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.УдалитьЗаписьЗаинтересованныеЛица(Объект, ТекущиеДанные.Пользователь);
	ОбщегоНазначенияКлиент.ОбновитьТаблицуЗаинтересованныхЛиц(Объект, ТаблицаЗаинтересованных);	
	Оповестить(СобытияОповещенияКлиент.ИмяСобытияОбновленияКоличестваЗаинтересованныхЛиц(), Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаЗаинтересованныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗаинтересованных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.ОткрытьФормуЗаписиЗаинтересованныеЛица(ЭтотОбъект, ТаблицаЗаинтересованных, КлючУникальности, Объект, ТекущиеДанные.Пользователь);
	
КонецПроцедуры

#КонецОбласти
