///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		// Функционал замера производительности
		УИДЗамера = ИнтеграцияДополнительныхПодсистемКлиент.НачатьЗамерВремени(Ложь, 
			"ОбщаяФорма.СтруктураПодчиненности.ОткрытиеФормы");
		
		ПараметрыОткрытия = Новый Структура("ОбъектОтбора, УИДЗамера", ПараметрКоманды, УИДЗамера);

		ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Источник.КлючУникальности, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;	
	
	ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	Функциональность = "Открытие вкладки ""Структура подчиненности""";
	ОбщегоНазначенияВызовСервера.ОтслеживаниеИспользованияФункциональностиНаСервере(Функциональность, ИмяФормы);
	
КонецПроцедуры
