///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОткрытьДанныеСобытия(Команда)
	
	ПодготовитьДанныеКОткрытию();
	
	ПараметрыОткрытия = Новый Структура("АдресВременногоХранилищаКоллекции", АдресВременногоХранилища);
	ОткрытьФорму("Обработка.ПросмотрНастроекПользователей.Форма.ФормаОтображенияКоллекции", ПараметрыОткрытия,
		ЭтотОбъект, КлючУникальности, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьДанныеКОткрытию()
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись", Тип("РегистрСведенийМенеджерЗаписи.ОчередьСобытийНаОбработку"));
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(МенеджерЗаписи.Данные.Получить(), УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
