///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с интерфейсом приложения на стороне клиента и на стороне сервера.
// - Процедуры и функции для общей формы НастройкиКолонок
//
//  
///////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для НастройкиКолонок

////////////////////////////////////////////////////////////////////////////////
// ПрименитьПользовательскиеНастройки() - процедура обновляет видимость колонок 
// Параметры:
// Элементы                         - ЭлементыФормы - для отображения видимости колонок
// ПользовательскиеНастройкиКолонок - Структура     - Настройки колонок
//
Процедура ПрименитьПользовательскиеНастройки(Элементы, Знач ПользовательскиеНастройкиКолонок) Экспорт 
	
	// Применение настроек видимости колонок
	Для Каждого ЭлементНастроек Из ПользовательскиеНастройкиКолонок.Состав Цикл
		Элементы[ЭлементНастроек.Значение].Видимость = ЭлементНастроек.Пометка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
