///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("Мессенджеры") Тогда 
		Для Каждого Мессенджер Из ДополнительныеСвойства.Мессенджеры Цикл 
			РегистрыСведений.АдресаПолучателей.Добавить(Мессенджер.Ссылка, Ссылка, Мессенджер.Адрес, Мессенджер.Идентификатор);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НастройкиПодключения") Тогда 
		УстановитьПривилегированныйРежим(Истина);
		Настройка = Справочники.Мессенджеры.ПолучитьНастройкуБезопасногоХранилища(Ссылка); 
		РегистрыСведений.БезопасноеХранилищеДанных.ПоместитьДанные(Настройка, 
			ДополнительныеСвойства.НастройкиПодключения);		
		УстановитьПривилегированныйРежим(Ложь);		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
