///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Перед открытием формы дополнительных реквизитов настраивает динамическую доступность реквизитов
//
// Параметры:
//  АдресДополнительныхРеквизитов - Строка - Адрес временного хранилища
//  Направление	- СправочникСсылка.НаправленияРазработки - Ссылка на направление					 - 	 - 
//  Автор - СправочникСсылка.Пользователи - Ссылка на пользователя							 - 	 - 
//
Процедура НастроитьБезопасность(Знач АдресДополнительныхРеквизитов, Знач Направление, Знач Автор) Экспорт
	
	Если УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли("ПолныеПрава") 
		ИЛИ УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли("Администратор") 
		ИЛИ Автор = ПараметрыСеанса.ТекущийПользователь Тогда
		
		Разрешено = Истина;
	ИначеЕсли ЗначениеЗаполнено(Направление) Тогда
		Разрешено = Справочники.НаправленияРазработки.ЭтоОтветственный(Направление);
	Иначе
		Разрешено = Ложь;	
	КонецЕсли;
		
	ДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресДополнительныхРеквизитов);
	
	Если ДанныеИзХранилища <> Неопределено И ТипЗнч(ДанныеИзХранилища) = Тип("ТаблицаЗначений") Тогда
		
		РедактируемыеРеквизиты = Новый Массив;
		РедактируемыеРеквизиты.Добавить(ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.Куратор);
		
		Для Каждого Реквизит Из РедактируемыеРеквизиты Цикл
			ПараметрыОтбора = Новый Структура("ВидРеквизита", Реквизит);
			
			Строки = ДанныеИзХранилища.НайтиСтроки(ПараметрыОтбора);
			
			Если Строки.Количество() > 0 Тогда
				Строки[0].РедактированиеВИнтерфейсе = Разрешено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ДанныеИзХранилища, АдресДополнительныхРеквизитов); 

КонецПроцедуры
	
#КонецОбласти
