///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет объект в избранное для конкретного пользователя
//
// Параметры:
//  Объект		 - ОпределяемыйТип.ОбъектИзбранного - объект, который пользователь добавляет в избранное 
//  ТипОбъекта	 - Перечисление.ТипыИзбранныхОбъектов - тип добавляемого в избранное объекта 
//
Процедура ДобавитьЗапись(Знач Объект, Знач ТипОбъекта) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	ЗаполнитьМенеджер(Менеджер, ТипОбъекта, Объект);
	Менеджер.Записать();
	
КонецПроцедуры

// Добавляет объект в избранное для конкретного пользователя
//
// Параметры:
//  Объект		 - ОпределяемыйТип.ОбъектИзбранного - объект, который пользователь добавляет в избранное 
//  ТипОбъекта	 - Перечисление.ТипыИзбранныхОбъектов - тип добавляемого в избранное объекта 
//
Процедура ИзменитьЗапись(Знач Объект, Знач ТипОбъекта, Знач Добавление) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	ЗаполнитьМенеджер(Менеджер, ТипОбъекта, Объект);
	
	Если Добавление Тогда
		Менеджер.Записать();
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Удаляет объект из избранного для конкретного пользователя
//
// Параметры:
//  Объект		 - ОпределяемыйТип.ОбъектИзбранного - объект, который пользователь добавляет в избранное 
//  ТипОбъекта	 - Перечисление.ТипыИзбранныхОбъектов - тип добавляемого в избранное объекта 
//
Процедура УдалитьЗапись(Знач Объект, Знач ТипОбъекта) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	ЗаполнитьМенеджер(Менеджер, ТипОбъекта, Объект);
	Менеджер.Удалить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Заполнить менеджер
//
// Параметры:
//  Менеджер	 - РегистрСведений.МенеджерЗаписи - Менеджер записи об избранном 
//  Объект		 - ОпределяемыйТип.ОбъектИзбранного - объект, который пользователь добавляет в избранное 
//  ТипОбъекта	 - Перечисление.ТипыИзбранныхОбъектов - тип добавляемого в избранное объекта
//
Процедура ЗаполнитьМенеджер(Менеджер, Знач ТипОбъекта, Знач Объект)
	
	Менеджер.Владелец = ПараметрыСеанса.ТекущийПользователь;
	Менеджер.ТипОбъекта = ТипОбъекта;
	Менеджер.Объект = Объект;
	Менеджер.ДатаСоздания  = ТекущаяДатаСеанса();
	
КонецПроцедуры	

#КонецОбласти


#КонецЕсли
