///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка ИЛИ ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипОбъектаКорректный(Отбор) Тогда
		ВызватьИсключение "Тип добавляемого объекта не соответствует указанному";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ТипОбъектаКорректный(Знач Отбор)
	
	РазрешенныеТипы = Новый Соответствие();
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.НаправленияРазработки"), Перечисления.ТипыИзбранныхОбъектов.Направления);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.Пользователи"), Перечисления.ТипыИзбранныхОбъектов.Пользователи);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.Продукты"), Перечисления.ТипыИзбранныхОбъектов.Продукты);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.СистемыУчета"), Перечисления.ТипыИзбранныхОбъектов.Системы);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.Филиалы"), Перечисления.ТипыИзбранныхОбъектов.Филиалы);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.ГруппыЗаказчиковНаправлений"), 
		Перечисления.ТипыИзбранныхОбъектов.ГруппыЗаказчиков);
	
	ТребуемыйТип = РазрешенныеТипы.Получить(ТипЗнч(Отбор.Объект.Значение)); 
	
	Если ТребуемыйТип = Отбор.ТипОбъекта.Значение Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
