///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(Иконка) Тогда
		Иконка = СтрЗаменить(Иконка, Символы.ПС, "");
		Иконка = СтрЗаменитьПоРегулярномуВыражению(Иконка, "\s(?:width|height|fill)=\042(?>none|#[[:xdigit:]]+|[[:digit:]]+|currentcolor)\042", "", Истина);
		Иконка = СтрЗаменитьПоРегулярномуВыражению(Иконка, "stroke=\042.*?\042", "stroke=""currentcolor""");
		//Иконка = СтрЗаменитьПоРегулярномуВыражению(Иконка, "<\/?g.*?>\n?", "");
		//Иконка = СтрЗаменитьПоРегулярномуВыражению(Иконка, "<defs>[\s\S]*?<\/defs>\n?", "");
	КонецЕсли;
	
КонецПроцедуры
