///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр сведений ИсторияАктуализацииЗаявокНаРазработку.
//
// Параметры:
//  Заявка   - ДокументСсылка.ЗаявкаНаРазработку - ссылка на заявку.
//  Действие - Число - действие над заявкой. Расшифровка значений указана в пояснении
//             к регистру сведений и в комментарии к ресурсу Действие.
//
Процедура ДобавитьЗапись(Знач Заявка, Знач Действие) Экспорт
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	НоваяЗапись.Период       = ТекущаяДатаСеанса();
	НоваяЗапись.Заявка       = Заявка;
	НоваяЗапись.Действие     = Действие;
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
