///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтандартныеСвойстваСтатусов(Команда)
	
	ТекстВопроса = "Все свойства статусов будут заполнены значениями по умолчанию.
		|Продолжить?";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветНаВопрос", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет,
		"Установка свойств статусов");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьОтветНаВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьСтандартныеСвойстваСтатусов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтандартныеСвойстваСтатусов()
	
	Справочники.СтатусыОбъектов.УстановитьСтандартныеСвойстваСтатусов();
	Элементы.Список.Обновить();	
	
КонецПроцедуры

#КонецОбласти
