///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьПредопределенноеНазначение(ИмяПредопределенного, Наименование, ИмяБота, МетаданныеБота) Экспорт
	
	Пользователь = СистемаВзаимодействия.СоздатьПользователя();
	Пользователь.Имя = ИмяБота;
	Пользователь.ПолноеИмя = ИмяБота;
	Пользователь.Записать();
	
	НовыйБот = СистемаВзаимодействия.СоздатьБота();
	НовыйБот.Метаданные = МетаданныеБота;
	НовыйБот.Пользователь = Пользователь.Идентификатор;
	НовыйБот.Записать();
	
	Ссылка = ПолучитьСсылку(Новый УникальныйИдентификатор(Пользователь.Идентификатор));
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.ИмяПредопределенныхДанных = ИмяПредопределенного;
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.УстановитьСсылкуНового(Ссылка);
	НовыйЭлемент.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
