///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Инициатор") Тогда
		РегистрыСведений.ОтслеживаниеИспользованияФункциональности.Добавить(Параметры.Инициатор, ИмяФормы);
	КонецЕсли;
	
	ИнструментыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПолеЗадачиНаТестирование.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнструментыКлиент.ПриОткрытии(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ИнструментыКлиент.ПриЗакрытии(ЗавершениеРаботы, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Документ.Задача.ИзменениеСтатусаЗадачи" Тогда
		ИнструментыКлиент.УстановитьПризнакНеобходимостиОбновления(ЭтотОбъект);
	КонецЕсли;
	
	ИнструментыКлиент.ОбработкаОповещения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеЗадачиНаТестированиеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НавигационнаяСсылка = ДанныеСобытия.Href;
	
	Если НЕ ПустаяСтрока(НавигационнаяСсылка) 
		И (ОбщегоНазначенияКлиент.ЭтоВебСсылка(НавигационнаяСсылка)
		ИЛИ ОбщегоНазначенияКлиент.ЭтоНавигационнаяСсылка(НавигационнаяСсылка)) Тогда 
		
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДанныеИнструмента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеИнструмента() Экспорт
	
	ИнструментыКлиент.ОбновлениеДанныхЗапущено(ЭтотОбъект);
	МетодОбновления = "Отчеты.ЗадачиНаТестирование.ПолучитьДанныеОтчета";
	
	ИнструментыКлиент.НачатьОбновлениеИнструмента(ЭтотОбъект, МетодОбновления,
		Новый Массив, Элементы.ПолеЗадачиНаТестирование.Имя, , "ОбработатьДанныеЗадачиНаТестирование");
	
	Элементы.Обновить.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеЗадачиНаТестирование() Экспорт
	
	ИнструментыКлиент.ОбработатьОтложенноеОбновлениеИнструмента(ЭтотОбъект, Элементы.ПолеЗадачиНаТестирование.Имя, "Отчеты.ЗадачиНаТестирование.ПолучитьДанныеОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновленияИнструмента(Данные, ДополнительныеПараметры) Экспорт
	
	ИнструментыКлиент.ЗаполнитьДанныеИнструмента(ПолеЗадачиНаТестирование, Данные, ДополнительныеПараметры.МетодОбновления);
	Элементы.Обновить.Доступность = Истина;
	ИнструментыКлиент.ЗакончитьОбновлениеИнструмента(ЭтотОбъект, ДополнительныеПараметры, Данные.УИДЗамера);
	
КонецПроцедуры

#КонецОбласти
