///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Документ "Фиксация трудозатрат"

// Возвращает текст с описанием ограничения периода внесения трудозатрат
//
// Параметры:
//  РазрешенныйПериод - Структура - структура со свойствами.
//  	* НачалоПериода - Дата - минимальная дата периода трудозатрат.
//  	* КонецПериода - Дата - максимальная дата периода трудозатрат.
//
// Возвращаемое значение:
//   Строка - текст предупреждения
//
Функция ТекстПредупрежденияОграниченияПериодаТрудозатрат(Знач РазрешенныйПериод) Экспорт

	ФорматДаты = "ДФ=dd.MM.yyyy";
	
	Текст = СтрШаблон("Доступный период добавления трудозатрат с %1 по %2",
		Формат(РазрешенныйПериод.НачалоПериода, ФорматДаты), 
		Формат(РазрешенныйПериод.КонецПериода, ФорматДаты));
			
	Возврат Текст;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Трудозатраты

// Получает структуру с видами трудозатрат
// 
// Возвращаемое значение:
//   Структура 
//
Функция ЗначенияФильтраТрудозатрат() Экспорт
	
	Значения = Новый Структура;
	Значения.Вставить("Общие", "Общие");
	
	Представление = ?(УчетТрудозатратВызовСервера.НесколькоФилиаловПользователя(), "Моих команд", "Моя команда");
	Значения.Вставить("ПоКомандам", Представление);
	
	Возврат Значения;
	
КонецФункции

#КонецОбласти
