///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		Объект = Параметры.Ссылка;
		Заголовок = "Описание: " + Строка(Объект);	
		
		НазваниеМетаданных = Объект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	ТекстHTML = Параметры.ТекстHTML;
	
	Если Параметры.Свойство("ТолькоПросмотрОписания") Тогда
		Элементы.ОткрытьОбъектОписания.Видимость = Ложь;
		Элементы.ВосстановитьОписание.Видимость = Истина;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	// форма открывается сразу с редактором
	Функциональность = РедакторОписанияКлиентСервер.ИмяСобытияОткрытияРедактора();
	ОбщегоНазначенияВызовСервера.ОтслеживаниеИспользованияФункциональностиНаСервере(Функциональность);
	
КонецПроцедуры

&НаКлиенте
Процедура ТексHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// При нажатии может внутри может оказаться ссылка - вызовем событие по ее открытию. воспользуемся стандартно библиотекой
	РедакторОписанияКлиент.ПриНажатииПоляHTMLДокумента(ЭтотОбъект, ДанныеСобытия, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОбъектОписания(Команда)
	
	ОткрытьФорму(НазваниеМетаданных + ".ФормаОбъекта", Новый Структура("Ключ", Параметры.Ссылка));
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьОписание(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти
