///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвторОбъекта = Параметры.Автор;
	
	Шрифт = Новый Шрифт( , , Истина);
	СтрокаЗадачи = СтрШаблон("""%1. %2""", Параметры.Номер, Параметры.Наименование);
	
	СоставСообщения = Новый Массив;
	СоставСообщения.Добавить("Доступ к заявке ");	
	СоставСообщения.Добавить(Новый ФорматированнаяСтрока(СтрокаЗадачи, Шрифт, ЦветаСтиля.ЦветЗаголовкаИнформационнойПанели));
	СоставСообщения.Добавить(" ограничен.");
	СоставСообщения.Добавить(Символы.ПС);
	СоставСообщения.Добавить(Символы.ПС);
	СоставСообщения.Добавить("Предоставить доступ к черновику может ");
	СоставСообщения.Добавить(Новый ФорматированнаяСтрока(Параметры.АвторПредставление, , , , " "));
	СоставСообщения.Добавить(".");
	
	Элементы.НадписьТекстСообщения.Заголовок = Новый ФорматированнаяСтрока(СоставСообщения);
	
	РегистрыСведений.ОтслеживаниеИспользованияФункциональности.Открытиеформы(ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НадписьТекстСообщенияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ИнтерфейсПриложенияКлиент.ОткрытьИнформациюОПользователе(ЭтотОбъект, АвторОбъекта, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти
