///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПредставлениеПериодичности();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПредставлениеПериодичности()
	
	Если ПериодичностьЗапуска = 0 Тогда
		ПредставлениеПериодичности = "Не задана";
		Возврат;
	КонецЕсли;
	
	ЗначениеПериодичностиЗапуска = ПериодичностьЗапуска;
	
	КоличествоДней = Цел(ЗначениеПериодичностиЗапуска / 86400);
	ЗначениеПериодичностиЗапуска = ЗначениеПериодичностиЗапуска - (КоличествоДней * 86400);
	
	КоличествоЧасов = Цел(ЗначениеПериодичностиЗапуска / 3600);
	ЗначениеПериодичностиЗапуска = ЗначениеПериодичностиЗапуска - (КоличествоЧасов * 3600);
	
	КоличествоМинут = Цел(ЗначениеПериодичностиЗапуска / 60);
	КоличествоСекунд = ЗначениеПериодичностиЗапуска - (КоличествоМинут * 60);
	
	ПредставленияПериодов = Новый Массив;
	
	Если КоличествоДней > 0 Тогда
		ПредставленияПериодов.Добавить(СтрШаблон("%1 дн.", Формат(КоличествоДней, "ЧГ=0")));
	КонецЕсли;
	
	Если КоличествоЧасов > 0 Тогда
		ПредставленияПериодов.Добавить(СтрШаблон("%1 час.", Формат(КоличествоЧасов, "ЧГ=0")));
	КонецЕсли;
	
	Если КоличествоМинут > 0 Тогда
		ПредставленияПериодов.Добавить(СтрШаблон("%1 мин.", Формат(КоличествоМинут, "ЧГ=0")));
	КонецЕсли;
	
	Если КоличествоСекунд > 0 Тогда
		ПредставленияПериодов.Добавить(СтрШаблон("%1 сек.", Формат(КоличествоСекунд, "ЧГ=0")));
	КонецЕсли;	
	
	ПредставлениеПериодичности = СтрСоединить(ПредставленияПериодов, " ");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
