///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПеревестиВремя(Знач Время) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Время) Тогда
		Возврат "";
	КонецЕсли;
	
	СекундВДне = 86400;
	
	Дней = Цел(Время / СекундВДне);
	Остаток = Время % СекундВДне;
	
	Часов = Окр(Остаток / 3600); 
	
	Конструктор = Новый Массив;
	
	Если Дней > 0 Тогда
		Конструктор.Добавить(СтрШаблон("%1 д.", Дней));
	КонецЕсли;
	
	Если Часов > 0 Тогда
		Конструктор.Добавить(СтрШаблон("%1 ч.", Часов));
	КонецЕсли;
		
	Если Конструктор.Количество() <> 0 Тогда
		Время = СтрСоединить(Конструктор, " ");
	Иначе
		Время = "0 ч.";
	КонецЕсли;
	
	Возврат Время;
	
КонецФункции
