///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ИмяРеквизитаАвтообновление() Экспорт
	
	Возврат "АвтообновлениеИнструмента";
	
КонецФункции

Функция ИмяРеквизитаДатаОбновления() Экспорт
	
	Возврат "ДатаОбновленияИнструмента";
	
КонецФункции

Функция ИмяРеквизитаРезультат(Знач ИмяТаблицы) Экспорт
	
	Возврат СтрШаблон("РезультатОбновления%1", ИмяТаблицы);
	
КонецФункции

Функция ИмяРеквизитаСтраницаИнструмента() Экспорт
	
	Возврат "СтраницаИнструмента";
	
КонецФункции

Функция ИмяРеквизитаТребуетсяОбновление() Экспорт
	
	Возврат "ТребуетсяОбновлениеИнструмента";
	
КонецФункции

Функция НавигационнаяСсылкаОткрытьНачальнуюСтраницу() Экспорт
	
	Возврат "e1cib/command/ОбщаяКоманда.ОткрытьНачальнуюСтраницу";
	
КонецФункции

Функция ПредставлениеПеречисления(Знач ЗначениеПеречисления) Экспорт

	Возврат СтрЗаменить(СтрЗаменить(Строка(ЗначениеПеречисления), ",", ""), " ", "");	

КонецФункции

#КонецОбласти
