///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Увеличивает счетчик согласно переданному статусу. В случае отсутствия записи для задачи создает её.
//
// Параметры:
//  Задача	 - ДокументСсылка.Задача	 - ссылка на задачу
//  Статус	 - СправочникСсылка.СтатусыОбъектов	 - статус, в который переведена задача
//
Процедура Добавить(Знач Задача, Знач Статус) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Задача = Задача;
	
	Запись.Прочитать();
	
	Если НЕ Запись.Выбран() Тогда
		Запись.Задача = Задача;
	КонецЕсли;
	
	Если Статус = Справочники.СтатусыОбъектов.Тестирование Тогда
		Запись.Тестирование = Запись.Тестирование + 1;
	ИначеЕсли Статус = Справочники.СтатусыОбъектов.CodeReview Тогда
		Запись.CodeReview = Запись.CodeReview + 1;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
