///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  

// Загружает записи в регистр сведений
//
// Параметры:
//  Период - ДатаВремя - Период записи 
//  ТаблицаЗаписей - ТаблицаЗначений - таблица записей с соответствующей структуре регистра структуре колонок
//
Процедура Загрузить(Знач Период, Знач ТаблицаЗаписей) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Загрузить(ТаблицаЗаписей);
	НаборЗаписей.Записать();	
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
