///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции управления доступом:
// - для управления блокировкой сеансов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Управление сеансами пользователей

// Упрощенная функция получения состояния блокировки сеансов. Отличается от 
// ПолучитьБлокировкуСеансовПользователей() тем, что проверяет только установку
// блокировки.
//
// Возвращаемое значение:
//  Булево. Истина - блокировка установлена. Ложь - в противном случае.
//
Функция БлокировкаСеансовУстановлена() Экспорт
	
	Возврат ПолучитьБлокировкуСеансов().Установлена;

КонецФункции

// Дублирует процедуру из модуля УправлениеДоступомПовтИсп
//
// Параметры:
//  Роль - Строка	 - название роли в конфигураторе
// 
// Возвращаемое значение:
//   - Булево
//
Функция ПроверитьДоступностьРоли(Знач Роль) Экспорт
	
	Возврат УправлениеДоступомПовтИсп.ПроверитьДоступностьРоли(Роль);
	
КонецФункции

#КонецОбласти
