///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получение переданного массива структур файлов
	МассивФайлов = Параметры.Файлы;
	
	// Заполнение таблицы файлов из структуры
	ЭлементыТаблицы = ТаблицаФайлов.ПолучитьЭлементы();
	Для Каждого СтруктураФайла Из МассивФайлов Цикл
		ЗаполнитьЗначенияСвойств(ЭлементыТаблицы.Добавить(), СтруктураФайла);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	МассивФайлов = Новый Массив;
	
	ЭлементыТаблицы = ТаблицаФайлов.ПолучитьЭлементы();
	Для Каждого Строка Из ЭлементыТаблицы Цикл
		СтруктураФайла = Новый Структура("АдресВХранилище, Имя, ПолноеИмя, РазмерСтрокой, ИндексКартинки");
		ЗаполнитьЗначенияСвойств(СтруктураФайла, Строка);
		МассивФайлов.Добавить(СтруктураФайла);
	КонецЦикла;
	
	Закрыть(МассивФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
