///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Необходимо проверить изменение наименования системы, т.к. в некоторых объектах оно кэшируется
	// для ускорения процесса формирования данных. Например, документ ЗаявкаНаРазработку, реквизит
	// ПредставлениеСистем.
	Если НЕ ЭтоНовый() Тогда
		СтароеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование");
		НаименованиеИзменено = (Наименование <> СтароеНаименование);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
