///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиент ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СформироватьНаименование(Услуга, ВидДеятельности);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьНаименование(Знач Услуга, Знач ВидДеятельности)
	
	КраткоеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Услуга, "КраткоеНаименование");
	НаименованиеВидаДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДеятельности, "Наименование");
	
	Возврат СтрШаблон("%1: %2", КраткоеНаименование, НаименованиеВидаДеятельности);
	
КонецФункции

#КонецОбласти

#КонецЕсли
