///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекущуюВерсию(Знач ТипАссетов) Экспорт
	
	Версия = "";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВерсииАссетовСрезПоследних.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.ВерсииАссетов.СрезПоследних(
	|			&Дата,
	|			ТипАссетов = &ТипАссетов
	|				И Обновлен) КАК ВерсииАссетовСрезПоследних";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипАссетов", ТипАссетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Версия = Выборка.Версия;
	КонецЕсли;
	
	Возврат Версия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Раздел «Служебные процедуры и функции» содержит процедуры и функции, составляющие 
// внутреннюю реализацию общего модуля.

#КонецОбласти
