///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции управления доступом:
// - служебные пользователи;
// - свойства текущего пользователя из справочника "Пользователи".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Служебные пользователи

// Проверяет имя текущего пользователя на совпадение с именем служебного пользователя.
//
// Возвращаемое значение:
//  Булево. Истина, если совпадает. Ложь, в противном случае.
//
Функция ЭтоСлужебныйПользователь() Экспорт
		
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "Служебный");  
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
#КонецОбласти
